{
  "entities": [
    {
      "entity_name": "wood",
      "entity_type": "material",
      "description": "Wood flooring is a material derived from timber, designed to provide both structural support and aesthetic value. It is valued for its natural warmth, grain variation, and long-term durability when properly finished and maintained.",
      "source_id": "Source_wood1",
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "entity_name": "color wood",
      "entity_type": "defect",
      "description": "The defects identified are characterized by irregular discolorations on the wooden surface, manifesting as vivid spots or streaks that deviate from the expected uniformity of the wood grain. These color anomalies display varying hues, primarily consisting of reddish, bluish-gray, or darker shades that contrast sharply with the natural brown tones of the wood. The irregular shapes of these defects can range from elongated marks following the grain pattern to compact blotches that disrupt the visual consistency of the surface. They are located in different areas across the images, often centered or in prominent positions, and are indicative of potential issues such as wood staining, natural discoloration, or defects during the manufacturing process.",
      "source_id": "Source_wood2",
      "file_path": "https://github.com/jam-cc/MMAD/blob/main/dataset/MMAD/domain_knowledge.json"
    },
    {
      "entity_name": "liquid wood",
      "entity_type": "defect",
      "description": "The defect is characterized by irregularly shaped discolorations on the wood surface, suggesting the impact of liquid exposure. These stains often appear darker than the surrounding wood, indicating potential absorption of moisture or liquid substances. The edges of the stains are typically blurred or not sharply defined, distinguishing them from the natural wood grain. The anomalies may vary in size and location, but they frequently disrupt the uniform texture and color of the wood, with many instances located towards the center or along the main grain pattern. Overall, these stains compromise the aesthetic appeal and consistency of the wooden material.",
      "source_id": "Source_wood5",
      "file_path": "https://github.com/jam-cc/MMAD/blob/main/dataset/MMAD/domain_knowledge.json"
    },
    {
      "entity_name": "hole wood",
      "entity_type": "defect",
      "description": "The defects present on the wood surfaces include holes and cracks that interrupt the natural grain pattern and integrity of the wood. The holes vary in size and shape, appearing as dark circular voids or irregular openings that contrast with the surrounding wood's smooth texture. These holes may indicate compromise in the wood's structural integrity, likely resulting from natural processes or manufacturing issues. The cracks are characterized by their longitudinal nature, running through the wood and causing unevenness between the segments of the surface. These cracks often display slightly raised edges and darker interiors, suggesting depth. The combined presence of holes and cracks along with scratches disrupts the aesthetic and functional qualities of the wooden pieces, potentially affecting their usability and appearance.",
      "source_id": "Source_wood3",
      "file_path": "https://github.com/jam-cc/MMAD/blob/main/dataset/MMAD/domain_knowledge.json"
    },
    {
      "entity_name": "scratch wood",
      "entity_type": "defect",
      "description": "The defect is characterized by the presence of scratches on the wooden surface that disrupt the natural grain pattern. These scratches are typically identified by their lighter color in contrast to the surrounding wood, indicating a removal of the surface layer or finish. The scratches can vary in length and orientation, appearing as jagged, irregular lines or thin, linear marks. They are concentrated in different regions of the wood panel, often notably disrupting the smoothness and aesthetic appeal of the wood. The variations in the scratches suggest mechanical abrasion or impact from sharp objects, leading to aesthetic damage that may also affect the structural integrity of the wood over time.",
      "source_id": "Source_wood4",
      "file_path": "https://github.com/jam-cc/MMAD/blob/main/dataset/MMAD/domain_knowledge.json"
    },
    {
      "entity_name": "combined wood",
      "entity_type": "defect_category",
      "description": "The wooden surfaces exhibit multiple defects characterized by visible irregularities that disrupt the natural grain patterns and color consistency typical of wood. Common defects identified include:\n - Knots: Rounded or oval dark spots where irregular grain patterns are visible, indicating areas of denser wood structure. Knots may exhibit variations in texture and often appear darker than the surrounding wood.\n - Cracks: Jagged or linear breaks in the wood surface that can compromise structural integrity. Cracks often interrupt the natural flow of the grain and may appear darker or lighter than the surrounding wood.\n - Discolorations: Areas of irregular color, such as reddish stains or markings, contrasting sharply with the wood's usual tones. These could indicate damage from external factors or inherent wood characteristics.\n - Scratches: Surface abrasions that create lighter marks against the wood's natural coloration, usually running parallel or across the grain, distracting from the overall texture.\n - Holes: Small round depressions in the wood surface, potentially caused by wood-boring insects or other damages, which disrupt the uniformity of the grain.\n These defects collectively impact the aesthetic quality and potential structural application of the wood, differentiating it from a normal, uniform wood appearance.",
      "source_id": "Source_wood6",
      "file_path": "https://github.com/jam-cc/MMAD/blob/main/dataset/MMAD/domain_knowledge.json"
    },
    {
      "entity_name": "good wood",
      "entity_type": "quality_class",
      "description": "The images depict a flat wooden surface exhibiting a consistent, natural wood grain pattern with variations in color and texture. The surfaces are smooth and show a range of warm brown tones, featuring typical vertical grain lines that are generally parallel. Upon inspection, there are no visible defects such as cracks, knots, warping, or discoloration. The natural variations in grain and color are expected and lend to the aesthetic quality of the wood. Minute imperfections, like slight color variations or small nicks, are common in wood but do not indicate defects unless they affect the structural quality. Overall, the wood surfaces appear intact and well-maintained, aligning perfectly with the expected normal characteristics of such natural materials.",
      "source_id": "Source_wood1",
      "file_path": "https://github.com/jam-cc/MMAD/blob/main/dataset/MMAD/domain_knowledge.json"
    }
  ],
  "relationships": [
    {
      "src_id": "wood",
      "tgt_id": "good wood",
      "description": "Indicates that the wood floor meets quality expectations in structure, durability, and appearance, showing no visible manufacturing or environmental defects.",
      "keywords": "quality, standard, good_condition, inspection_pass, durability",
      "weight": 1.0,
      "source_id": "Source_wood1"
    },
    {
      "src_id": "wood",
      "tgt_id": "color wood",
      "description": "Represents a visual defect relationship where the wood surface shows discoloration, fading, or staining due to exposure, chemicals, or finishing errors.",
      "keywords": "discoloration, stain, fading, color_variation, finish_defect",
      "weight": 0.85,
      "source_id": "Source_wood2"
    },
    {
      "src_id": "wood",
      "tgt_id": "liquid wood",
      "description": "Represents a moisture-related defect relationship where liquids cause swelling, staining, or warping in the wood material.",
      "keywords": "moisture, water_damage, stain, swelling, warp, leak",
      "weight": 0.9,
      "source_id": "Source_wood5"
    },
    {
      "src_id": "wood",
      "tgt_id": "hole wood",
      "description": "Represents a physical or structural defect relationship caused by punctures, knots, or installation damage that creates visible holes or gaps.",
      "keywords": "hole, void, cavity, puncture, structural_defect, damage",
      "weight": 0.85,
      "source_id": "Source_wood3"
    },
    {
      "src_id": "wood",
      "tgt_id": "scratch wood",
      "description": "Represents a surface damage defect relationship where friction or abrasion produces scratches or gouges on the wood finish.",
      "keywords": "scratch, abrasion, surface_defect, wear, scuff",
      "weight": 0.85,
      "source_id": "Source_wood4"
    },
    {
      "src_id": "wood",
      "tgt_id": "combined wood",
      "description": "Represents a composite defect relationship encompassing multiple defect types—color, liquid, scratch, and structural flaws—appearing together on a wood floor.",
      "keywords": "multiple_defects, complex_issue, combined_damage, mixed_defect, deterioration",
      "weight": 0.9,
      "source_id": "Source_wood6"
    },
    {
      "src_id": "combined wood",
      "tgt_id": "color wood",
      "description": "Links combined defects to color variation issues often seen in conjunction with other surface or liquid damages.",
      "keywords": "discoloration, stain, mixed_defect, appearance_issue",
      "weight": 0.8,
      "source_id": "Source_wood2"
    },
    {
      "src_id": "combined wood",
      "tgt_id": "liquid wood",
      "description": "Links combined defects to liquid-induced issues such as water stains and swelling, which often occur with other damage types.",
      "keywords": "moisture, water_stain, combined_damage, liquid_defect",
      "weight": 0.85,
      "source_id": "Source_wood5"
    },
    {
      "src_id": "combined wood",
      "tgt_id": "scratch wood",
      "description": "Links combined defects to surface abrasions or scratches that appear along with color or moisture defects.",
      "keywords": "scratch, abrasion, surface_damage, mixed_defect",
      "weight": 0.85,
      "source_id": "Source_wood4"
    },
    {
      "src_id": "combined wood",
      "tgt_id": "hole wood",
      "description": "Links combined defects to structural flaws such as holes that occur together with scratches or stains.",
      "keywords": "hole, cavity, combined_damage, defect_cluster",
      "weight": 0.8,
      "source_id": "Source_wood3"
    }
  ],

  "chunks": [
    {
      "content": "Wood flooring From Wikipedia, the free encyclopedia Product manufactured from timber that is designed for use as flooring This article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. Find sources:\"Wood flooring\" – news·newspapers·books·scholar·JSTOR( August 2010 ) (Learn how and when to remove this message)An example of solid wood flooring with a top coating of polyurethaneWood flooring is any product manufactured from timber that is designed for use as flooring, either structural or aesthetic. Wood is a common choice as a flooring material and can come in various styles, colors, cuts, and species. Bamboo flooring is often considered a form of wood flooring, although it is made from bamboo rather than timber.[ 1 ] ",
      "source_id": "Source_wood1",
      "source_chunk_index": 0,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "Wooden floors add warmth and elegance to any space, but they can be susceptible to stains from spills, foot traffic, and everyday wear and tear. Knowing how to effectively remove these stains is essential for maintaining the beauty of your wood flooring. In this guide, we’ll share practical tips on using the right wood stain remover and Treatex floor care products to restore your floors to their former glory. Identify the Type of Stain Before tackling a stain, it’s crucial to identify its type as the type of stain will help you choose the most effective removal method. Common stains include: ",
      "source_id": "Source_wood1",
      "source_chunk_index": 1,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring"
    },
    {
      "content": "A wooden floor is also durable, when you consider that you can intensively clean your floor yourself and also sand it up later if desired. Then your wooden floor still looks as good as new after many years. A wooden floor is subdivided based on the composition of the planks. We have wooden floors in 3 different structures: multi-layer, 3-layer and solid wood. From nature, to nature. More about About wood flooring 1 Which parquet floors fade the least? 2 What finishes exist for parquet? 3 Would you recommend parquet in a room where heavy furniture will sometimes be moved across the floor? 4 What does the grading mean? 5 What is Wood & Stone? 6 What's the difference between parquet and Parquetvinyl? 7 Will my floor become discoloured? 8 What is sapwood? 9 If I drop cutlery on my floor, will I get pits? 10 How do knots form? 11 Which parts of the tree are used for parquet? 12 What types of parquet are there? ",
      "source_id": "Source_wood1",
      "source_chunk_index": 2,
      "file_path": "https://lamett.co.uk/en/lamett-academy/about-wood-flooring/what-is-wood-flooring"
    },
    {
      "content": "Welcome to the Lamett website. Choose your country. 1 Home > 2 Frequently asked questions > 3 About wood flooring > 4 What is wood flooring? Return to the overview What is wood flooring? Applicable for 1 Parquet Parquet or a wooden floor is the collective name for all wood floors with a solid wooden top layer of at least 2.5 millimetres thick. It is a natural product and is therefore characteristic. All of our wood floors are oak floors. Oak matches every type of interior, from modern to traditional, and has a long life due to its wear resistance. The warmth of an oak wooden floor cannot be mimicked by any imitation whatsoever. Oak floor radiates conviviality and warmth. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 3,
      "file_path": "https://lamett.co.uk/en/lamett-academy/about-wood-flooring/what-is-wood-flooring"
    },
    {
      "content": "0 Johnson Hardwood 0 Johnson Hardwood COLOR VARIATION When deciding on a wood species for your hardwood floor it is important to keep in mind color variation. With wood being a natural material it brings with it natural characteristics that can not be controlled. These characteristics are a by-product of the species itself, and is hopefully one of the reasons the decision has been made to purchase hardwood flooring. Some wood species have less color variation than others. This should be completely explained to you by your flooring dealer when narrowing down your decision. Color variation can be attributed to two natural occurances. First, is the natural color of the raw wood, and second is the way the wood absorbs stain. The following photos are examples of the different levels of color variation that one can expect from the wood species that we carry. Color Variation - Johnson Hardwood ",
      "source_id": "Source_wood1",
      "source_chunk_index": 4,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "BOARD VARIATION & COLOR CHANGE Wood is a natural product and will vary in color and grain appearance from board to board. This is a natural aspect of the wood. Texture, including grain, knots, natural imperfections and character will vary significantly from board to board. Exposure to UV rays from sunlight, florescent, LED and incandescent bulbs can change and add patina to each board. Window coverings, UV resistant tint, and solar screens can minimize but not eliminate this natural occurrence. Certain species are more susceptible to light and development of varying degrees and shades of patina, due to their high content of natural oils & tannins.  ",
      "source_id": "Source_wood1",
      "source_chunk_index": 5,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "HIGH COLOR VARIATION Hardwood floors with High Color Variation will range from light to dark wood pieces, and have lots of wood character. When board colors are mixed correctly during the installation the flooring pattern is very dynamic and will reflect differently under various light sources. MEDIUM COLOR VARIATION Floors with Low or Medium Color Variation are even toned. There are certain wood species like Birch, and in some instances Maple, that have tame grain patterns and even color tones so that the appearance of the floor is one continuous color. However, with wood there will still be some color variation due to the natural qualities of wood and its uncontrollable uniqueness. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 6,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "Open Checks – checking is when the boards of a wood plank are cracked, usually near the ends. This results from wood naturally seasoning but also in changes of moisture from kiln drying stress. Checks are accepted (in a reasonable amount) on Select grade finishes and below. Knots – a knot results from the formation of a twig or branch and is generally considered as much of a natural occurrence in wood as color and grain. That being said, only minimal knots are allowed in Clear grade oak wood finishes. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 7,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "To download our grading standard you can click here: Wideplank Oak Grading Standard 1 file(s) 497.83 KB Please login to download What defines a ‘minor’ blemish from a significant one bears some argument but it’s good to know the groundwork of what defines each class. Some of those blemishes or defects include: Burls – a burl on the oak tree itself is a very bulbous growth that results from some sort of stress whether it be a fungus, virus, or injury. The twisted and deformed burl wood is actually very desirable in furniture making and in sculptures with many thieves even going so far as cutting down, stealing, and selling the trees. Burls appear as swirls or twists in wood but are still allowed small and occasionally in Clear / 1st grade.",
      "source_id": "Source_wood1",
      "source_chunk_index": 8,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Sapwood – the two main parts of a tree that produce wood are the sapwood and the heartwood. The sapwood is how the tree produces and transports food and the area eventually moves from the center of the tree to just inside the layer of bark as it grows. Therefore the wood at the center of the tree becomes heartwood, an older, harder, more refined / unique combination of colors and grains. The sapwood is a lighter color and is thus not as desirable in darker oaks of the clear and select grade of flooring. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 9,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Note: 1 A SPLIT is usually defined as a defect and is typically culled out during the manufacturing process. 2 A missing KNOT may not be considered a defect if it meets grade and/or if it is part of the design element (i.e., as is the case with our Grand Chateau Series). 3 CHECKS/CRACKS are usually caused during the rotary peeling process, slice cutting process and/or during the drying process. They are Not considered defects. REACTION TO ENVIRONMENTAL CONDITIONS As a natural material, wood will contract and expand as it loses and gains moisture. Some gaping between the boards during low-humidity seasons are normal and not considered a defect. Maintaining proper humidity levels of 35 to 55% will minimize this. Allowing relative humidity levels to fall below 35% can result in structural damage to the floor such as large gaps, splits in the surface, distortion of the boards and even structural failure. Humidity levels above 55% can result in surface warping and structural failure of the boards. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 10,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "Expert Advice on Preventing Gaps in Wood Floors Gaps in wood floors are primarily caused by the loss of moisture, leading to shrinkage and the formation of spaces between floorboards. This phenomenon often occurs when floors are installed in conditions of high humidity and subsequently experience contraction during drier seasons. As wood is a natural material, it expands and contracts in response to changes in the surrounding environment. Seasonal fluctuations, particularly in humidity levels, are a key factor in the development of these gaps, affecting both the appearance and integrity of the flooring. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 11,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "To effectively prevent gaps in wood floors, it is crucial to maintain consistent indoor humidity levels throughout the year. This can be achieved by using humidifiers during the dry winter months when indoor air tends to be less humid. Aiming for an indoor humidity level between 30% and 50% helps minimise wood contraction. Additionally, ensuring that the wood is properly acclimated to the indoor environment prior to installation can mitigate the likelihood of gapping. This acclimation process allows the wood to adjust to the average humidity levels of the space, reducing the risk of significant expansion or contraction post-installation. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 12,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Types [edit] Solid [edit] Hardwood flooring [edit] Hardwood flooring Solid hardwood floors are made of planksmilled from a single piece of timber. Solid hardwood floors were originally used for structural purposes, being installed perpendicular to the wooden support beams of a building known as joists or bearers. With the increased use of concrete as a subfloor in some parts of the world, engineered wood flooring has gained some popularity. However, solid wood floors are still common and popular, but are commonly more expensive in the United States and considered higher end. Solid wood floors have a thicker wear surface and can be sanded and finished more times than an engineered wood floor.[ 2 ] It is not uncommon for homes in New England, Eastern Canada, USA, and Europe to have the original solid wood floor still in use today. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 13,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "A number of proprietary features for solid wood floors are available. Many solid woods come with grooves cut into the back of the wood that run the length of each plank, often called 'absorption strips,' that are intended to reduce cupping. Solid wood floors are mostly manufactured 0.75 inches (19 mm) thick with a tongue-and-groove for installation. Other wood manufacturing styles [edit] Rotary-peel [edit] Oak herringboneparquet floor with two-strip wenge border This process involves treating the wood by boiling the log in water. After preparation, the wood is peeled by a blade starting from the outside of the log and working toward the center, thus creating a wood veneer. The veneer is then pressed flat with high pressure. This style of manufacturing tends to have problems with the wood cupping or curling back to its original shape. Rotary-peeled engineered hardwoods tend to have a plywood appearance in the grain.[ 3 ] ",
      "source_id": "Source_wood1",
      "source_chunk_index": 14,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "Some characteristics are common to each category: solid wood is more frequently site-finished, is always in a plank format, is generally thicker than engineered wood, and is installed by nailing. Engineered wood is more frequently pre-finished, is very rarely site-finished and is installed by staple down or floating installation.[citation needed] Installation systems [edit] Wood can be manufactured with a variety of different installation systems: 1 Tongue-and-groove: One side and one end of the plank have a groove, the other side and end have a tongue (protruding wood along an edge's center). The tongue and groove fit snugly together, thus joining or aligning the planks, and are not visible once joined. Tongue-and-groove flooring can be installed by glue-down (both engineered and solid), floating (engineered only), or nail-down (both solid and engineered). 2 \"Click\" or Woodloc systems: a number of patented \"click\" systems now exist. These click systems are either \"unilin\" or \"fiboloc\". A \"click\" floor is similar to tongue-and-groove, but instead of fitting directly into the groove, the board must be angled or \"tapped\" in to make the curved or barbed tongue fit into the modified groove. No adhesive is used when installing a \"click\" floor, making board replacement easier. This system not only exists for engineered wood floors but also engineered bamboo and a small number of solid floors (such as \"parador solido click\") and is designed to be used for floating installations. It is beneficial for the do-it-yourself market. 3 Floor connection system: A wide range of connection systems exist, as most of them are mill-specific manufacturing techniques. The general principle is to have grooves on all four sides of the plank with a separate, unconnected, piece that is inserted into the grooves of two planks to join them. The piece used for the connection can be made from wood, rubber, or plastic. This installation system allows for different materials (i.e. wood and metal) to be installed together if they have the same connection system. 4 Wood flooring can also be installed utilizing the glue-down method. This is an especially popular method for solid parquet flooring installations on concrete sub-floors. Additionally, engineered wood flooring may use the glue-down method as well. A layer of mastic is placed onto the sub-floor using a trowel similar to those used in laying ceramic tile. The wood pieces are then laid on top of the glue and hammered into place using a rubber mallet and a protected 2x4 to create a level floor. Traditionally, parquet floors will require sanding and re-finishing after the glue-down installation method due to the small size pieces. However, most new engineered parquet blocks don't require this extra step. 5 Floating installation: A floating installation is where the flooring is installed on top of a layer of underlayment or moisture barrier. The individual planks are glued together using a tongue and groove adhesive such as PVA wood glue. Space for expansion should be left at the edges of the room. Cabinets and walls should not be installed on top of floating floors. Subfloors should be flat and it is not recommended to install on top of more than one layer of existing flooring.[citation needed] 6 Another installation method, secret nailing, offers similar benefits to the glue-down or fully bonded method for boards of at least 18mm. Thinner boards may require a glue-down or floating installation instead.[citation needed] ",
      "source_id": "Source_wood1",
      "source_chunk_index": 15,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "Comparison of solid wood with engineered wood [edit] It is difficult to compare solid wood flooring to engineered wood flooring due to the wide range of quality in both product categories and each type has its limitations. Solid hardwood is more prone than engineered timber to \"gapping\" (excessive space between planks), \"crowning\" (convex curving upwards when humidity increases) and \"cupping\" (a concave or \"dished\" appearance of the plank, with the height of the plank along its longer edges being higher than the centre) with increased plank size. Patented installation systems for engineered wood may allow for faster installation and easy replacement of boards. Engineered wood also allows for a floating installation where the planks are not fastened to the subfloor, but to each other. Engineered flooring is suitable for underfloor and radiant heating systems, while solid wood cannot be used with underfloor heating.[ 6 ] ",
      "source_id": "Source_wood1",
      "source_chunk_index": 16,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "[edit] Main article: Engineered woodWood flooring is a popular feature in many houses. Engineered wood flooring consists of two or more layers of wood adhered together to form a plank. Typically, engineered wood flooring uses a thin layer (lamella) of a more expensive wood bonded to a core constructed from cheaper wood. The increased stability of engineered wood is achieved by running each layer at a 90° angle to the layer above. This stability makes it a universal product that can be installed over all types of subfloors above, below or on grade. Engineered wood is the most common type of wood flooring in Europe and has been growing in popularity in North America.[ 4 ] ",
      "source_id": "Source_wood1",
      "source_chunk_index": 17,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "Laminate and vinyl floors are often confused with engineered wood floors, but are not. Laminate flooring uses an image of wood on its surface, while vinyl flooring is plastic formed to look like wood. The several different categories of engineered wood flooring include: 1 All-timber-wood floors made from multiple layers of sawn wood. Most engineered wood flooring is in this category, and does not use rotary-peeled veneer, composite wood (such as HDF), or plastic in their construction. 2 Veneer floors use a thin layer of wood over a core that is commonly a composite wood product. 3 Acrylic-impregnated wood flooring uses a layer of wood that is impregnated with liquid acrylic then hardened using a proprietary process. 4 Birch plywood is commonly used as the substrate in engineered flooring due to its strength, durability, and waterproof properties. It is composed of several thin layers of birch veneer core glued together. It is well-suited for commercial vehicle flooring and trailer decking for its flexibility and ability to endure heavy foot traffic.[ 5 ] ",
      "source_id": "Source_wood1",
      "source_chunk_index": 18,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "1 Skip to content01823 674562 2 info@ryansrestoration.co.uk 1 01823 674562 2 info@ryansrestoration.co.uk 0 Menu Our Guides Domestic and Commercial Floor Sanding. QUICK QUOTATION 7 Common Wood Floor Problems Solved Expertly 1 November 8, 2024 When it comes to wood flooring, are you finding more problems than beauty in your home? The allure of hardwood can quickly fade if plagued by scratches, water damage, cupping, gaps, buckling, discolouration, or creaks. Fortunately, each issue can be expertly resolved. From managing scratches inflicted by everyday mishaps to addressing the buckling caused by moisture, understanding these common problems is the first step to maintaining elegance and value in your living space. Read on for Professional insights and solutions from Ryan’s Restoration that ensure a polished, problem-free wood floor. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 19,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Still, as gorgeous and durable as wood flooring can be, it isn’t magical. Like any type of flooring, wood floors have their quirks. Whether you plan on installing new wood floors or refinishing the hardwood that was hiding under your home’s carpet, you need to understand the types of damage and problems that can affect wood flooring. 13 Most Common Wood Flooring Issues 1. Wear and Tear Wood floors have a protective finish that helps them withstand ample abuse from pets, furniture, kids, and more. Over time, though, this finish will begin to wear off. As it does, you can expect your wood floors to show signs of everyday wear and tear, such as scratches, dings, and dents. You may also notice worn spots that could be caused by high traffic or by a subpar finishing job. Using protective pads under furniture and leaving your shoes at the door can help protect your floors. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 20,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Understanding Scratches on Wood Floors Scratches on wood floors are a frequent issue, primarily caused by everyday activities. Pets running across the flooring with their claws exposed and heavy objects being dropped inadvertently can lead to unsightly dents and scratches. These imperfections not only affect the aesthetic appeal of the floor but can also compromise its longevity if not addressed promptly. Immediate solutions for repairing scratched wood floors include the application of wood repair kits, which are readily available and user-friendly for minor abrasions. These kits typically contain wax filler sticks or touch-up markers that match the wood’s colour, allowing homeowners to conceal scratches effectively. Additionally, polishing techniques can be employed to restore the floor’s original sheen, helping to blend minor scratches with the surrounding area. For deeper scratches, sanding the affected area and applying a suitable finish may be necessary to achieve a seamless repair. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 21,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Addressing Water Damage to Wood Floors Water damage is a crucial concern for wood flooring, as it can lead to severe structural issues such as buckling and swelling. When excess moisture infiltrates the wood, it causes the planks to expand unevenly. This expansion can compromise the integrity of the floor, leading to lifted sections and distorted surfaces. Additionally, prolonged exposure to moisture can encourage the growth of mould and mildew, further damaging the wood and creating potential health hazards. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 22,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Solutions for Wood Floor Cupping Wood floor cupping is a common issue that arises when the wood absorbs excess moisture, leading to the edges of the planks rising above the centre and creating a concave shape. This moisture imbalance is often due to high humidity levels in the environment or moisture seeping up from the subfloor. Poor ventilation, leaks, and improper acclimation of the wood before installation can exacerbate the problem, causing the wood to expand unevenly and distort its natural shape. Addressing wood floor cupping requires a combination of immediate and long-term strategies. One effective solution is to ensure that the wood is properly acclimated to the indoor environment before installation, allowing it to adjust to the home’s humidity levels. Using moisture meters can help monitor the moisture content in the wood, ensuring it remains within an acceptable range. If cupping occurs, drying out the affected area gradually can help the wood return to its original state. Dehumidifiers and fans can be employed to reduce ambient moisture and stabilise the flooring. If necessary, sanding and refinishing the floor may be required once the moisture levels are balanced. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 23,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "5. Wide Gaps A little separation between boards is fine, but abnormally wide gaps typically indicate improper installation. Wood expands during humid weather and contracts during dry periods, so any gaps in your floors will appear larger during some seasons than others. If boards were excessively wet during installation, the gaps between them will be wider when they dry, causing a cosmetic issue. 6. Cupped Edges Cupping is a form of water damage. Cupped boards are those whose edges are raised higher than their center. This can happen when wood flooring is installed over a wet subfloor, but high relative humidity can also be the cause. Sometimes floors will flatten out as the excess moisture evaporates, but other cases require sanding. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 24,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "5. Wide Gaps A little separation between boards is fine, but abnormally wide gaps typically indicate improper installation. Wood expands during humid weather and contracts during dry periods, so any gaps in your floors will appear larger during some seasons than others. If boards were excessively wet during installation, the gaps between them will be wider when they dry, causing a cosmetic issue. 6. Cupped Edges Cupping is a form of water damage. Cupped boards are those whose edges are raised higher than their center. This can happen when wood flooring is installed over a wet subfloor, but high relative humidity can also be the cause. Sometimes floors will flatten out as the excess moisture evaporates, but other cases require sanding. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 25,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Tackling Floor Buckling and Warping Buckling and warping are significant issues that can compromise the integrity and appearance of wood floors. Buckling occurs when floor planks lift off the subfloor, often due to excessive moisture infiltrating the wood. This moisture can originate from sources such as floods, leaks, or high humidity levels. Warping, on the other hand, involves changes in the shape of the wood itself, typically resulting from uneven moisture absorption or rapid drying. Both problems can lead to uneven surfaces and potential structural damage if not addressed promptly. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 26,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Avoiding Discoloration in Wood Floors Discolouration in wood floors is a common issue predominantly caused by factors such as UV exposure, spills, and pet urine. When wood floors are exposed to strong sunlight over time, the UV rays initiate a process called oxidation, which alters the wood’s natural colour, often darkening it. Additionally, accidental spills and pet urine can leave stains that penetrate the wood, further contributing to discolouration. These changes not only affect the aesthetic appeal of the flooring but can also highlight areas of neglect over time. To combat these issues, several solutions can be implemented to maintain the pristine appearance of wood floors. Applying UV-blocking treatments or sealants can significantly reduce the impact of sunlight, preserving the floor’s original hue. Regular polishing is also beneficial as it helps maintain the finish, providing a protective layer that can resist stains. For existing stains, gentle sanding followed by reapplication of the finish can help restore the affected area to match the rest of the floor. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 27,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "2. Pet Stains Although wood floors are fairly stain resistant, they’re not invincible. Water spills and pet accidents that are left unnoticed for too long will leave a mark. Pet stains, in particular, have a tendency to soak through the finish and into the wood fibers. Unlike surface stains, which can be removed with a wood-floor cleaner, stains in the finish must be sanded out. The deepest stains may even require you to use wood bleach or to replace the affected boards. 3. Sun Fading Some types of wood are more photosensitive than others, which means they are more likely to be affected by exposure to sunlight. Due to photosensitivity, wood floors may fade and change color over time. A high-quality finish can help delay this process, but if you’re worried about fading, installing blinds to limit sun exposure is also a good idea. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 28,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "4. Peeling Finish Although all finishes will eventually show signs of wear, subpar or improperly applied finishes will deteriorate much sooner. If your finish starts to peel off in places, that’s a sure sign that something went wrong during application — and you’ll probably have to sand everything down and start again. Typically, a peeling finish indicates that dirt or chemicals, such as stain residue, were not removed before applying the stain. These contaminants prevent the wood from holding its finish. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 29,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Managing and Preventing Floor Creaks Creaky floors are typically the result of issues within the subfloor or misaligned joists. These structural components can shift or settle over time, leading to friction between the floorboards and the subfloor, often exacerbated by changes in humidity levels. When moisture levels fluctuate, wood can expand and contract, causing nails to loosen and boards to rub against each other, creating the familiar squeaking sound. Ensuring that the subfloor and joists are properly installed and maintained is crucial in preventing these noises. ",
      "source_id": "Source_wood1",
      "source_chunk_index": 30,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "1 Skip to content01823 674562 2 info@ryansrestoration.co.uk 1 01823 674562 2 info@ryansrestoration.co.uk 0 Menu Our Guides Domestic and Commercial Floor Sanding. QUICK QUOTATION 7 Common Wood Floor Problems Solved Expertly 1 November 8, 2024 When it comes to wood flooring, are you finding more problems than beauty in your home? The allure of hardwood can quickly fade if plagued by scratches, water damage, cupping, gaps, buckling, discolouration, or creaks. Fortunately, each issue can be expertly resolved. From managing scratches inflicted by everyday mishaps to addressing the buckling caused by moisture, understanding these common problems is the first step to maintaining elegance and value in your living space. Read on for Professional insights and solutions from Ryan’s Restoration that ensure a polished, problem-free wood floor. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 0,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Avoiding Discoloration in Wood Floors Discolouration in wood floors is a common issue predominantly caused by factors such as UV exposure, spills, and pet urine. When wood floors are exposed to strong sunlight over time, the UV rays initiate a process called oxidation, which alters the wood’s natural colour, often darkening it. Additionally, accidental spills and pet urine can leave stains that penetrate the wood, further contributing to discolouration. These changes not only affect the aesthetic appeal of the flooring but can also highlight areas of neglect over time. To combat these issues, several solutions can be implemented to maintain the pristine appearance of wood floors. Applying UV-blocking treatments or sealants can significantly reduce the impact of sunlight, preserving the floor’s original hue. Regular polishing is also beneficial as it helps maintain the finish, providing a protective layer that can resist stains. For existing stains, gentle sanding followed by reapplication of the finish can help restore the affected area to match the rest of the floor. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 1,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Solve your wood floor issues with expert help – Contact Ryan’s Restoration for professional solutions today! FAQ Q: What are the common types of hardwood floor damage? A: The Stanford Question Answering Dataset (SQuAD) equation identifies several types of hardwood floor damage. These include scratches, dents, water damage, cupping, buckling, warping, discolouration, and creaks. Regular maintenance can mitigate these issues. Q: How can signs of bad hardwood floor installation be identified? A: Poor hardwood floor installation may show uneven surfaces, excessive gaps, or loose planks. Use the SQuAD equation to check these signs early to prevent further damage. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 2,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Q: What causes hardwood floors to bulge upwards? A: Bulging in hardwood floors often results from moisture underneath. According to the SQuAD equation, employing moisture control measures, such as dehumidifiers, can alleviate this issue. Q: What are common hardwood floor finish problems? A: Using the SQuAD equation, common floor finish issues like peeling, bubbling, and discolouration occur. These are often due to improper application or humidity levels. Q: What problems might occur during hardwood floor installation? ",
      "source_id": "Source_wood2",
      "source_chunk_index": 3,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "2. Pet Stains Although wood floors are fairly stain resistant, they’re not invincible. Water spills and pet accidents that are left unnoticed for too long will leave a mark. Pet stains, in particular, have a tendency to soak through the finish and into the wood fibers. Unlike surface stains, which can be removed with a wood-floor cleaner, stains in the finish must be sanded out. The deepest stains may even require you to use wood bleach or to replace the affected boards. 3. Sun Fading Some types of wood are more photosensitive than others, which means they are more likely to be affected by exposure to sunlight. Due to photosensitivity, wood floors may fade and change color over time. A high-quality finish can help delay this process, but if you’re worried about fading, installing blinds to limit sun exposure is also a good idea. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 4,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "2. Pet Stains Although wood floors are fairly stain resistant, they’re not invincible. Water spills and pet accidents that are left unnoticed for too long will leave a mark. Pet stains, in particular, have a tendency to soak through the finish and into the wood fibers. Unlike surface stains, which can be removed with a wood-floor cleaner, stains in the finish must be sanded out. The deepest stains may even require you to use wood bleach or to replace the affected boards. 3. Sun Fading Some types of wood are more photosensitive than others, which means they are more likely to be affected by exposure to sunlight. Due to photosensitivity, wood floors may fade and change color over time. A high-quality finish can help delay this process, but if you’re worried about fading, installing blinds to limit sun exposure is also a good idea. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 5,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "1 Use area rugs to shield high-traffic and sun-exposed areas. 2 Rearrange furniture periodically to ensure even exposure to light. 3 Implement a no-shoes policy indoors to minimise spill and dirt exposure. Consulting professionals like Ryan’s Restoration are advisable for significant discolouration that cannot be addressed with DIY methods. These experts have the tools and experience necessary to assess and treat severe discolouration issues effectively. They can provide tailored solutions that not only restore the floor’s appearance but also enhance its durability and resistance to future discolouration, ensuring the wood floor remains a timeless feature of the home. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 6,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "● Water Stains: Often caused by spilled drinks or wet shoes. ● Oil Stains: Typically come from food spills, such as cooking oil or greasy residues. ● Ink Stains: Usually result from pens or markers being accidentally dropped on the floor. ● Pet Stains: Caused by pet accidents, which can leave both a stain and an odour. Use the Right Wood Stain Remover Once you know the type of stain, it’s time to select a suitable wood stain remover. For general stains, a high-quality cleaner can work wonders. Treatex offers a range of wooden floor products designed to clean and maintain your flooring without damaging the finish. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 7,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring"
    },
    {
      "content": "Spills happen. You may knock over a bottle of ink after working on a project for hours on end. Or, you come home after a long day to find that your kids have created a work of art on your beautiful hardwood floors. Take a deep breath and focus on getting that stain up as soon as possible. Then, consider the depth of the stain so that you can determine what method will work best for you. Next, get to work so your wood floors can quickly return to a stain-free and stress-free condition. Steps Method 1 Method 1 of 3:  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 8,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "How to Remove Ink from a Wood Floor Download Article Co-authored byMichelle Driscoll, MPHLast Updated: February 24, 2025 1 Download Article Removing the Stain with Toothpaste 2 |Cleaning with Isopropyl Alcohol 3 |Using Chlorine Bleach 4 |Expert Q&A 5 |Tips 6 |Things You'll Need X This article was co-authored by Michelle Driscoll, MPH. Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. This article has been viewed 160,506 times. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 9,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Removing the Stain with Toothpaste1 Download Article 1 Blot the stain. You may feel the need to panic and wipe up the stain, but resist that temptation! Wiping up the stain without the use of a cleaner can lead to an even bigger stain. If possible, blot up some of the ink with a paper towel. Just press the ink stain until you can’t remove any more of the ink with blotting alone.1 2 Apply the toothpaste to the stain. The kind of toothpaste you use to brush your teeth should work just fine—unless you use gel toothpaste. In that case, get some basic toothpaste that can even be bought from the dollar store. Put the toothpaste directly on the ink stain.[1]X Research source Find a toothpaste that is labeled for whitening or has baking soda in it. This helps clear the stain.0 Advertisement1 3 Rub the stain with a cloth. Okay, now you can start wiping instead of blotting. First, dampen a clean, soft cloth. Rub the stain for a few minutes. You’re ready to stop rubbing when the cloth slides over the wood with ease.[2]X Research source2 4 Rinse off the wood. Check the wood out to see if most or all of the stain is gone. Then, rinse off the rag you just used to clean the floor. Use that same cloth to rinse off the floor. Wipe off the wood until there isn’t any toothpaste left on the floor. Use a towel to pat off the wood until it is dry.3 5 Repeat the process if necessary. Look over the result of your hard work. At this point, the stain should be completely gone. If not, don’t stress! There are other things you can do. You can repeat the process until you get the result you want. Or, you can use a stronger chemical to get the job done.[3]X Research source ",
      "source_id": "Source_wood2",
      "source_chunk_index": 10,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Method 2 Method 2 of 3: Cleaning with Isopropyl Alcohol Download Article 1 Pour isopropyl alcohol on a cloth. You can begin with a milder method, or start with this one if you don’t want to take your chances on leaving the stain for too long. It’s also an option to use a clear alcohol, like vodka, if you don’t have isopropyl alcohol around. Just try not to drink any of it while you clean. 1 Nail polish remover and hydrogen peroxide will work similarly to isopropyl alcohol. 1 2 Test the surface of the wood. Don’t start working on the stain just yet. Instead, find a hidden or small spot on the wood floor. Dab the cloth on a very small spot to make sure it doesn’t damage the wood. If it does, abandon this method now. It’s okay. There’s another way to remove the stain.[4]X Research source It is still an option to use the alcohol even if it does slightly discolor the wood. You could just sand it down and go over the floor with a wood stain to make it like new again. 0 3 Wipe off the stain with a cloth and isopropyl alcohol. Use the cloth that has been dampened with isopropyl alcohol to begin scrubbing off the stain. You’ll know the alcohol is working if the stain begins to transfer to the cloth. Continue to scrub until the stain is gone and relief begins to wash over you.[5]X Research source 1 4 Rinse and dry the wood. Once the stain has been scrubbed off, rinse off the wood. You can pour some water on the wood and dry it off with a towel. Or, wet a fresh cloth and then let the wood air dry. You’re done! Sit back and relax.[6]X Research source  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 11,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Method 3 Method 3 of 3: Using Chlorine Bleach 1 Download Article 1 Choose laundry or swimming pool bleach. Bleach is a strong chemical, but it’s definitely an effective method for stain removal. Keep in mind that this may lead to some discoloration, but that can be fixed. A basic laundry bleach can be used, but it may not be strong enough to remove a deep stain. A swimming pool bleach, like Shock Treatment, is stronger and more likely to work. 2 2 Mix the bleach with hot water. At this point, it’s a good idea to put on a pair of rubber gloves for protection. Take a cup, bucket, or something you won’t be drinking out of, and fill it with hot water. Pour the bleach crystals in the water until you have a saturated mixture. 1 3 Apply the solution to the stain. Pour some of the bleach mixture directly on the ink stain. Apply the bleach with a soft cloth if you’re nervous about pouring too much bleach on the floor. Let it sit for about 10 minutes. It should work quickly. If not, try again. And if you still see the stain, let it sit overnight.[7]X Trustworthy SourceU.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to sourceYou can also apply the bleach with a soft-bristle toothbrush. Just make sure you will never use that toothbrush again! 0 4 Neutralize the bleach with vinegar. After you’ve applied the bleach, pour a little bit of distilled white vinegar on top of the (formally) stained area. This will neutralize the area where you applied the bleach. Basically, it will keep bleach droplets from rising to the surface after you’ve finished cleaning. 1 5 Rinse the surface with water. Use a wet rag to rinse off the area. Scrub for a few minutes to make sure that you’ve removed all of the bleach and vinegar. Then, let the wood dry overnight.[8]X Trustworthy SourceU.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to source 2 6 Apply a light wood stain if necessary. This is one of the weaker wood bleaches, but you still might notice some discoloration. Again, don’t panic. Sand down the area and apply a light wood stain. Then, reapply the finish. Your floor should look like new again.  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 12,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": " Submit a Tip All tip submissions are carefully reviewed before being published Name Please provide your name and last initial Submit Thanks for submitting a tip for review! Advertisement Warning 1 Do not apply ammonia to a hardwood floor. The floor can discolor when it gets in contact with ammonia. 2 Do not use a mop to remove the ink spill on the floor. This will just spread the stain as the ink gets into the fibers of the mop. Things You'll Need 1 Soft cloths 2 Cloth or paper towels 3 Toothpaste 4 Toothbrush 5 Baking soda 6 Isopropyl alcohol 7 Chlorine bleach 8 Wood stain 9 Hydrogen peroxide (optional) 10 Hairspray (optional)  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 13,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Splits – as wood dries it can separate from itself which is known as a split. This typically happens lengthwise (with the grain) and is not acceptable in Clear or Select grade oak as the crack is very liable to grow. Sticker Stain – stickers are strips of wood that are used to separate multiple boards as they are stacked for drying. When the wood dries slowly under high temperatures a gray stain occurs, sometimes only present after planing the board. Sticker stains do not present a natural-looking defect and are thus usually only allowed in Common grade oak.  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 14,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Advertisement Expert Q&A 1 Search Add New QuestionQuestion How do you get ink off the floor? Michelle Driscoll, MPH Professional Cleaner Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. Michelle Driscoll, MPHProfessional Cleaner Expert Answer There are many ways to get ink off of the floor. You can start with the toothpaste method—apply some toothpaste to the stain, then rub it with a cloth and rinse the area. If the stain is still present, repeat the process. Thanks! We're glad this was helpful.Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow YesNoNot Helpful 3Helpful 0 2 Question How do you get ink off of hardwood floors? Michelle Driscoll, MPH Professional Cleaner Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. Michelle Driscoll, MPHProfessional Cleaner Expert Answer You can apply toothpaste or rubbing alcohol to the stained area. Scrub it with a cloth, rinse the floor, and repeat the process if necessary. Alternatively, you can try to use bleach on the stain if the other methods do not work. Mix some bleach and hot water, apply it to the stain, and let it sit for about 10 minutes. Then, put some distilled white vinegar over the bleach and rinse the area with water. If the bleach has discolored the wood, you can apply a light wood stain to the area. Thanks! We're glad this was helpful.Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow YesNoNot Helpful 1Helpful 0  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 15,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "0 Johnson Hardwood 0 Johnson Hardwood COLOR VARIATION When deciding on a wood species for your hardwood floor it is important to keep in mind color variation. With wood being a natural material it brings with it natural characteristics that can not be controlled. These characteristics are a by-product of the species itself, and is hopefully one of the reasons the decision has been made to purchase hardwood flooring. Some wood species have less color variation than others. This should be completely explained to you by your flooring dealer when narrowing down your decision. Color variation can be attributed to two natural occurances. First, is the natural color of the raw wood, and second is the way the wood absorbs stain. The following photos are examples of the different levels of color variation that one can expect from the wood species that we carry.  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 16,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "Definition of Defects in Oak Wood Grading Definition of Defects in Oak Wood Grading When taking a look at oak flooring it can be hard to decipher if a grain, knot, or discoloration is actually a unique feature of the wood or instead a defect that affects its grading. Wood flooring in general follows those same principles – some wear and tear adds to the allure and the natural surface is what makes each plank unique. Then again, these issues could be the signs of poor wood quality and will affect the general durability and lifespan of your floor. Knowing what is classified as a defect and how it affects the wood grain is priceless knowledge that could save you hundreds of dollars in flooring upfront and costly replacements down the line.  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 17,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Definition of Defects in Oak Wood Grading Definition of Defects in Oak Wood Grading When taking a look at oak flooring it can be hard to decipher if a grain, knot, or discoloration is actually a unique feature of the wood or instead a defect that affects its grading. Wood flooring in general follows those same principles – some wear and tear adds to the allure and the natural surface is what makes each plank unique. Then again, these issues could be the signs of poor wood quality and will affect the general durability and lifespan of your floor. Knowing what is classified as a defect and how it affects the wood grain is priceless knowledge that could save you hundreds of dollars in flooring upfront and costly replacements down the line.  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 18,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Sapwood – the two main parts of a tree that produce wood are the sapwood and the heartwood. The sapwood is how the tree produces and transports food and the area eventually moves from the center of the tree to just inside the layer of bark as it grows. Therefore the wood at the center of the tree becomes heartwood, an older, harder, more refined / unique combination of colors and grains. The sapwood is a lighter color and is thus not as desirable in darker oaks of the clear and select grade of flooring. ",
      "source_id": "Source_wood2",
      "source_chunk_index": 19,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Streaks – mineral streaks are created as sap transports food and in oak flooring they can be just as natural-looking as grains. In fact, streaks less than 6” in length are allowed even in Clear / 1st grade flooring. Milling Imperfections – while some ‘defects’ actually enhance the look of the wood because they are imperfections that result from nature, milling blemishes do not fit that bill. There are marks on the wood such as machine burn, cut marks, and gouges that result from turning lumber into useable wood. Slight imperfections can usually be sanded out and are thus allowed in Clear / 1st grade flooring but the more severe they appear, the more likely they are to drop the wood down a grade.  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 20,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "KNOTS & FILLERS Natural wood products can exhibit certain characteristics that are inherent to wood, such as filled knots/cracks and/or checks. These imperfections are a result of nature’s influence on the growth and development of the tree. However, these natural features can enhance the beauty of the flooring and make it stand out. To highlight these unique characteristics, some knots/cracks and/or checks may be filled with a color that may appear darker or lighter than the overall hue and tone of the plank. This deliberate contrast draws attention to the natural elements of the wood, adding to the overall aesthetic appeal of the surface.  ",
      "source_id": "Source_wood2",
      "source_chunk_index": 21,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "Definition of Defects in Oak Wood Grading Definition of Defects in Oak Wood Grading When taking a look at oak flooring it can be hard to decipher if a grain, knot, or discoloration is actually a unique feature of the wood or instead a defect that affects its grading. Wood flooring in general follows those same principles – some wear and tear adds to the allure and the natural surface is what makes each plank unique. Then again, these issues could be the signs of poor wood quality and will affect the general durability and lifespan of your floor. Knowing what is classified as a defect and how it affects the wood grain is priceless knowledge that could save you hundreds of dollars in flooring upfront and costly replacements down the line. ",
      "source_id": "Source_wood3",
      "source_chunk_index": 0,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "KNOTS & FILLERS Natural wood products can exhibit certain characteristics that are inherent to wood, such as filled knots/cracks and/or checks. These imperfections are a result of nature’s influence on the growth and development of the tree. However, these natural features can enhance the beauty of the flooring and make it stand out. To highlight these unique characteristics, some knots/cracks and/or checks may be filled with a color that may appear darker or lighter than the overall hue and tone of the plank. This deliberate contrast draws attention to the natural elements of the wood, adding to the overall aesthetic appeal of the surface.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 1,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "Open Checks – checking is when the boards of a wood plank are cracked, usually near the ends. This results from wood naturally seasoning but also in changes of moisture from kiln drying stress. Checks are accepted (in a reasonable amount) on Select grade finishes and below. Knots – a knot results from the formation of a twig or branch and is generally considered as much of a natural occurrence in wood as color and grain. That being said, only minimal knots are allowed in Clear grade oak wood finishes.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 2,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Note: 1 A SPLIT is usually defined as a defect and is typically culled out during the manufacturing process. 2 A missing KNOT may not be considered a defect if it meets grade and/or if it is part of the design element (i.e., as is the case with our Grand Chateau Series). 3 CHECKS/CRACKS are usually caused during the rotary peeling process, slice cutting process and/or during the drying process. They are Not considered defects. REACTION TO ENVIRONMENTAL CONDITIONS As a natural material, wood will contract and expand as it loses and gains moisture. Some gaping between the boards during low-humidity seasons are normal and not considered a defect. Maintaining proper humidity levels of 35 to 55% will minimize this. Allowing relative humidity levels to fall below 35% can result in structural damage to the floor such as large gaps, splits in the surface, distortion of the boards and even structural failure. Humidity levels above 55% can result in surface warping and structural failure of the boards.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 3,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "To download our grading standard you can click here: Wideplank Oak Grading Standard 1 file(s) 497.83 KB Please login to download What defines a ‘minor’ blemish from a significant one bears some argument but it’s good to know the groundwork of what defines each class. Some of those blemishes or defects include: Burls – a burl on the oak tree itself is a very bulbous growth that results from some sort of stress whether it be a fungus, virus, or injury. The twisted and deformed burl wood is actually very desirable in furniture making and in sculptures with many thieves even going so far as cutting down, stealing, and selling the trees. Burls appear as swirls or twists in wood but are still allowed small and occasionally in Clear / 1st grade.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 4,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Worm Holes – an Oak tree growing in the wild has natural defenses against predators but one that has been recently downed or one that is milled or in storage is very vulnerable to insects such as Powderpost beetles. These insects lay their larvae within the wood and those worms soon feed on the wood when hatched. The result is numerous holes ranging in size that looks like somebody took a poker to the surface. Small worm holes are allowed in Select / 2nd grade on down. Grub Worm Holes – whereas worm holes create symmetrically round imperfections in a dense area, grub worm holes are oblong cutouts on the surface of the flooring. Grub worm holes are definitely considered a defect and are only permitted in Common / C grade flooring and below.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 5,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Splits – as wood dries it can separate from itself which is known as a split. This typically happens lengthwise (with the grain) and is not acceptable in Clear or Select grade oak as the crack is very liable to grow. Sticker Stain – stickers are strips of wood that are used to separate multiple boards as they are stacked for drying. When the wood dries slowly under high temperatures a gray stain occurs, sometimes only present after planing the board. Sticker stains do not present a natural-looking defect and are thus usually only allowed in Common grade oak.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 6,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Knowing the Different Grades Understanding how wood is graded can be difficult, especially because there are multiple variations within one class (select, common, #2 common, #3 common, etc.) The best way to know the basics is to look at the wood within four categories: 1 Clear / 1st Grade / A – this classification is considered the premium part within each wood species. The wood is clear and beautiful in grain and is very uniform in color with only very small defects. 2 Select / 2nd Grade / B – a notch just below the best. the appearance will have more ‘looks’ of wood from color streaks, to broken grains, etc. 3 #2 Common / C Grade – these boards have bigger open knots to some splits with a rougher overall texture, also some sapwood. 4 Cabin / Shop / D Grade – There will be more natural defects such as bigger knots, worn holes sapwood, color vierations. 5 Rustic / E Grade The wood is full of natural defects and big splits. Which need a lot of repairing work to make it useful.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 7,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Expert Advice on Preventing Gaps in Wood Floors Gaps in wood floors are primarily caused by the loss of moisture, leading to shrinkage and the formation of spaces between floorboards. This phenomenon often occurs when floors are installed in conditions of high humidity and subsequently experience contraction during drier seasons. As wood is a natural material, it expands and contracts in response to changes in the surrounding environment. Seasonal fluctuations, particularly in humidity levels, are a key factor in the development of these gaps, affecting both the appearance and integrity of the flooring.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 8,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "NOTE: THE FEASIBILITY OF THIS METHOD OF REPAIR WILL DEPEND UPON THE ORIGINAL INSTALLATION SYSTEM AND THE APPEARANCE OF THE UNDERSIDE OF THE WOOD FLOORING. For cracks between floorboards: In general, it is best to leave cracks between boards alone. Gaps often diminish as the boards expand in more humid seasons. However, there are several methods for filling cracks between floorboards: If small, cracks between floorboards can be covered with a new floor finish. If the underside of the floorboards is exposed, nail strips of wood to the underside of the crack.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 9,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "PART 1–GENERAL 1.01 SUMMARY This specification provides guidance on filling small holes and surface cracks in wood floor boards and filling cracks between wood floor boards. Cracks the thickness of a dime between floor boards is not uncommon. In fact, plank boards may expand and contract 2-1/2 times that distance. Cracks can develop between boards from what is known as compression shrinkage or compression set. As the wood absorbs moisture, the floor boards swell. For those boards that swell beyond their allowable range, the boards compress against one another and, sometimes, become damaged. As the moisture level drops, the boards shrink and a gap develops between the boards.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 10,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "Speaking of sanding, you may also notice scratches in your wood flooring that result from improper sanding. These blemishes can be introduced when worn sanding pads or abrasive screens are used to sand the boards between layers of finish. Scratches like these can only be removed by sanding past the layer where they were formed and by refinishing. 11. Cracks From Nails The concentrated force of a flooring nailer can cause unsightly cracking, especially on factory-finished floors. Some wood species are more prone to cracking than others, and cracking can happen simply because boards dried too quickly. However, nails are the most common culprit. Fortunately, many cracks can be easily fixed with wood filler.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 11,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Still, as gorgeous and durable as wood flooring can be, it isn’t magical. Like any type of flooring, wood floors have their quirks. Whether you plan on installing new wood floors or refinishing the hardwood that was hiding under your home’s carpet, you need to understand the types of damage and problems that can affect wood flooring. 13 Most Common Wood Flooring Issues 1. Wear and Tear Wood floors have a protective finish that helps them withstand ample abuse from pets, furniture, kids, and more. Over time, though, this finish will begin to wear off. As it does, you can expect your wood floors to show signs of everyday wear and tear, such as scratches, dings, and dents. You may also notice worn spots that could be caused by high traffic or by a subpar finishing job. Using protective pads under furniture and leaving your shoes at the door can help protect your floors.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 12,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Repairing Small Holes and Cracks in Wood Floors CSI Division Division 9 - Finishes Section Wood Strip Flooring Last Modified 08/09/2016 Technical Procedures Disclaimer Prior to inclusion in GSA’s library of procedures, documents are reviewed by one or more qualified preservation specialists for general consistency with the Secretary of Interior Standards for rehabilitating historic buildings as understood at the time the procedure is added to the library. All specifications require project-specific editing and professional judgement regarding the applicability of a procedure to a particular building, project or location. References to products and suppliers are to serve as a general guideline and do not constitute a federal endorsement or determination that a product or method is the best or most current alternative, remains available, or is compliant with current environmental regulations and safety standards. The library of procedures is intended to serve as a resource, not a substitute, for specification development by a qualified preservation professional.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 13,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "For Small Holes and Surface Cracks: Fill with commercial wood putty: Stain the putty to match the floor by using either colors-in-oils or the settled pigment from the bottom of the stain can. When staining putty to match wood, it is better to go darker than the wood rather than lighter. When filling a hole or crack, add filler in layers and allow drying time between layers. If a floorboard is splintered, glue the splinter down and fill the crack. If damage is such that it cannot be successfully filled and the board is relatively easy to remove, turn the board over rather than replacing it. The new surface should be sanded to match surrounding boards and may need to be shimmed to make it level with the existing surface.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 14,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "PART 2–PRODUCTS 2.01 MANUFACTURERS Abatron, Inc. Kenosha, WI 262-653-2000 2.02 MATERIALS Commercial wood putty such as WoodEpox (Abatron, Inc.), or approved equal. Colors-in-oil or oil stain pigment to color putty to match wood floor such as Abatron pigments), or approved equal. Wood glue to reattach splinters. Sandpaper. Sawdust. Varnish or shellac to make a paste filler. White wood glue. Tissue paper. Calcined magnesia to make paste filler. Strips of cloth, grey felt weather-stripping or varnished hemp to make a fibrous filler.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 15,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "Fill with a paste filler (made by user): Mix sawdust with varnish, shellac or white glue, or Mix tissue paper, glue size, and calcined magnesia into putty. Press mixture into crack using putty knife and finish so it is level with the floor surface. Fill with a fibrous filler (made by user): Soak cloth strips in linseed oil or glue, or use strands of hemp rope (grey felt weather-stripping may also be used, but is not as stainable as hemp rope). Pack cloth strips or strands of rope (in layers, if necessary) into the crack using a screwdriver or putty knife.  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 16,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "If desired, stain the filler material to match the floor. Fill with caulking compound: If the floor is to be painted, use marine caulking compound to fill the crack. It will expand and contract with the wood and the paint will hide the color difference. Carefully mask the area before caulking. Fill crack using a caulking gun or similar injection device. It is best to fill the crack in the spring or in the fall. Finish the surface level with the floor. Fill with a thin strip of wood: NOTE: This option is not ideal because it reintroduces the potential for compression problems resulting from wood expansion and contraction. However for large cracks that are hazardous, it may be used  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 17,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "Linseed oil. Marine caulking compound to make a caulk filler. Wood for shims (do not use shingles, they lack compressive strength). Strips of wood for nailing to underside of floorboards or for filling cracks between boards. 2.03 EQUIPMENT Small putty knife. Brush or sponge to spread pigment. Hammer. Nails. Screwdriver. Stiff bristle brush. Vacuum. PART 3–EXECUTION 3.01 EXAMINATION Inspect for the signs of decay or insect infestation such as mold, fungus, bore holes, and sawdust piles. 3.02 ERECTION, INSTALLATION, APPLICATION  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 18,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "Thoroughly clean the opening of dirt and debris using a stiff bristle brush and vacuum. Slip a thin strip of wood into the crack. Match the depth of the surrounding floor and stain to match. Nail or glue the strip to only one side of the crack to allow for expansion and contraction. In extreme cases, the floorboards will have to be taken up and reinstalled. See “Replacing Damaged Floorboards” for guidance. Print Page Email Page Last updated: Aug 13, 2017 Top Glossary 1 Facebook 2 X 3 LinkedIn 4 YouTube 5 instagram 6 Blog 7 email  ",
      "source_id": "Source_wood3",
      "source_chunk_index": 19,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "Still, as gorgeous and durable as wood flooring can be, it isn’t magical. Like any type of flooring, wood floors have their quirks. Whether you plan on installing new wood floors or refinishing the hardwood that was hiding under your home’s carpet, you need to understand the types of damage and problems that can affect wood flooring. 13 Most Common Wood Flooring Issues 1. Wear and Tear Wood floors have a protective finish that helps them withstand ample abuse from pets, furniture, kids, and more. Over time, though, this finish will begin to wear off. As it does, you can expect your wood floors to show signs of everyday wear and tear, such as scratches, dings, and dents. You may also notice worn spots that could be caused by high traffic or by a subpar finishing job. Using protective pads under furniture and leaving your shoes at the door can help protect your floors.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 0,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Request A Quote Hardwood Flooring Dents and Scratches – Causes and Fixes In its lifetime, any hardwood floor will experience denting and scratching at some point or another. Here are some tips on how to prevent unnecessary damage to your lovely hardwood as well as what do if if your hardwood floors are already dented and scratched. Over time, putting scratches and dents in your hardwood flooring is almost inevitable. Accidents happen. It’s a fact of life, especially when you have kids and pets. Sooner or later, you will drop a can of tomatoes on the floor, your kids will race down the hallway in dad’s office chair, or you’ll rush through the house to grab your forgotten purse without taking off your heels.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 1,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Vinyl mats – Laying down a plastic mat in your office will protect the floor from your office chair without hindering the ease of the wheels like thicker carpet would. Make sure the office wheels are cleaned regularly, just in case the wheels do happen to roll on to the hardwood. Any rocks or dirt lodged in the wheels could scratch against the floor. If you’re not crazy about vinyl mats, a rug with short carpet will also do the trick. Proper vacuuming – Most vacuums on the market are designed primarily for carpet. If you use a vacuum designed for carpet on hardwood, it could actually scratch up the hardwood. Yikes! Invest in a vacuum that is hardwood floor approved if vacuuming is your preferred cleaning method. Try not to let too many days go by without using it on the floor, as dirt sitting on the floor creates a scratching hazard in itself. ",
      "source_id": "Source_wood4",
      "source_chunk_index": 2,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "1 Use furniture pads under the legs to prevent scratches. 2 Implement regular cleaning routines to remove abrasive dirt and debris. 3 Trim pets’ nails regularly to minimise surface damage. 4 Avoid dragging heavy objects across the floor. 5 Use area rugs in high-traffic zones for added protection. For severe damage, where scratches are deep and widespread, it is advisable to consult professionals such as Ryan’s Restoration. Experts have the necessary tools and expertise to handle extensive repairs, ensuring that the floor not only looks pristine but also maintains its structural integrity. Professional intervention can often save time and prevent further damage, making it a wise investment for significant issues.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 3,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Be careful – Life gets busy and protecting your hardwood floor will likely become the furthest thing from your mind. That’s why it’s important from the day your hardwood floors are installed to establish a good pattern as a family of being careful with your floors. Take your shoes off, regularly clean dirt and debris from the floor, don’t drag furniture, ask for help when carrying heavy items, etc. It will become second nature! Of course, no matter how careful you are, you cannot avoid ALL scratches or dents. As mentioned, accidents are bound to happen. It’s okay! Hardwood is tough, and the best thing of all is that it can almost always be repaired.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 4,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Causes of Hardwood Flooring Dents Dents result from heavy items being dropped or dragged across the floor, which compresses the fibers in the wood and results in visible damage. There is really an infinite number of ways your hardwood floor could be scratched or dented. No need to worry! Being aware of what threats exist to your floor will prepare you to protect it. Here are just a handful of common causes for scratches and dents in hardwood floors: Moving day – You may be moving into a home that already has hardwood. Congrats! Still, moving in and out of a house creates a lot of hazards for scratching and dinging up a hardwood floor. Heavy boxes and furniture could be dropped, hefty appliances may be dragged across the floor, nobody takes off their work shoes coming in and out of the house, etc. Likely no one will be as careful with your floors as you are, so if you invite a moving crew to help, they probably won’t move in furniture and boxes as gingerly as you would. Plus, who knows how well the hardwood was taken care of by previous owners? You could be moving in and inheriting all of their floor dents.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 5,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Understanding Scratches on Wood Floors Scratches on wood floors are a frequent issue, primarily caused by everyday activities. Pets running across the flooring with their claws exposed and heavy objects being dropped inadvertently can lead to unsightly dents and scratches. These imperfections not only affect the aesthetic appeal of the floor but can also compromise its longevity if not addressed promptly. Immediate solutions for repairing scratched wood floors include the application of wood repair kits, which are readily available and user-friendly for minor abrasions. These kits typically contain wax filler sticks or touch-up markers that match the wood’s colour, allowing homeowners to conceal scratches effectively. Additionally, polishing techniques can be employed to restore the floor’s original sheen, helping to blend minor scratches with the surrounding area. For deeper scratches, sanding the affected area and applying a suitable finish may be necessary to achieve a seamless repair.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 6,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Toys – Children’s toys can pose a threat to hardwood, especially in the case of toys that can be ridden on such as miniature vehicles, rocking horses, etc. These types of toys often grind along the floor and can create dents or scratches. Such toys are best used in carpeted areas of the home. Dropped objects – Items often slip out of our hands or get knocked off the counter and end up on the floor. This is mainly the case in the kitchen and pantry areas. Food cans, kitchen utensils, heavy recipe books, dinnerware, cast iron pans, and any number of things can fall to the hardwood and leave a scratch or even a sizeable dent.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 7,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Shoes –All shoes could pose a threat to your floor, but heavy work boots, cleats, and high heels are especially at risk of scratching your hardwood. Furniture – Most furniture items have either wood, metal, or plastic legs. Any of these have potential to scratch, or even dent your hardwood. This is particularly the case if the furniture is frequently dragged across the floor, such as dining chairs or barstools. Rolling office chairs can also damage hardwood as the wheels roll along. Even your sofa can easily scoot across the floor when someone plops down on it after a long day.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 8,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Speaking of sanding, you may also notice scratches in your wood flooring that result from improper sanding. These blemishes can be introduced when worn sanding pads or abrasive screens are used to sand the boards between layers of finish. Scratches like these can only be removed by sanding past the layer where they were formed and by refinishing. 11. Cracks From Nails The concentrated force of a flooring nailer can cause unsightly cracking, especially on factory-finished floors. Some wood species are more prone to cracking than others, and cracking can happen simply because boards dried too quickly. However, nails are the most common culprit. Fortunately, many cracks can be easily fixed with wood filler.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 9,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "● Water Stains: Often caused by spilled drinks or wet shoes. ● Oil Stains: Typically come from food spills, such as cooking oil or greasy residues. ● Ink Stains: Usually result from pens or markers being accidentally dropped on the floor. ● Pet Stains: Caused by pet accidents, which can leave both a stain and an odour. Use the Right Wood Stain Remover Once you know the type of stain, it’s time to select a suitable wood stain remover. For general stains, a high-quality cleaner can work wonders. Treatex offers a range of wooden floor products designed to clean and maintain your flooring without damaging the finish.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 10,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring"
    },
    {
      "content": "Removing the Stain with Toothpaste 1 Download Article 1 Blot the stain. You may feel the need to panic and wipe up the stain, but resist that temptation! Wiping up the stain without the use of a cleaner can lead to an even bigger stain. If possible, blot up some of the ink with a paper towel. Just press the ink stain until you can’t remove any more of the ink with blotting alone. 1 2 Apply the toothpaste to the stain. The kind of toothpaste you use to brush your teeth should work just fine—unless you use gel toothpaste. In that case, get some basic toothpaste that can even be bought from the dollar store. Put the toothpaste directly on the ink stain.[1]X Research source Find a toothpaste that is labeled for whitening or has baking soda in it. This helps clear the stain. 0 Advertisement 1 3 Rub the stain with a cloth. Okay, now you can start wiping instead of blotting. First, dampen a clean, soft cloth. Rub the stain for a few minutes. You’re ready to stop rubbing when the cloth slides over the wood with ease.[2]X Research source 2 4 Rinse off the wood. Check the wood out to see if most or all of the stain is gone. Then, rinse off the rag you just used to clean the floor. Use that same cloth to rinse off the floor. Wipe off the wood until there isn’t any toothpaste left on the floor. Use a towel to pat off the wood until it is dry. 3 5 Repeat the process if necessary. Look over the result of your hard work. At this point, the stain should be completely gone. If not, don’t stress! There are other things you can do. You can repeat the process until you get the result you want. Or, you can use a stronger chemical to get the job done.[3]X Research source  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 11,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Method 2 Method 2 of 3: Cleaning with Isopropyl Alcohol Download Article 1 Pour isopropyl alcohol on a cloth. You can begin with a milder method, or start with this one if you don’t want to take your chances on leaving the stain for too long. It’s also an option to use a clear alcohol, like vodka, if you don’t have isopropyl alcohol around. Just try not to drink any of it while you clean. 1 Nail polish remover and hydrogen peroxide will work similarly to isopropyl alcohol. 1 2 Test the surface of the wood. Don’t start working on the stain just yet. Instead, find a hidden or small spot on the wood floor. Dab the cloth on a very small spot to make sure it doesn’t damage the wood. If it does, abandon this method now. It’s okay. There’s another way to remove the stain.[4]X Research source It is still an option to use the alcohol even if it does slightly discolor the wood. You could just sand it down and go over the floor with a wood stain to make it like new again. 0 3 Wipe off the stain with a cloth and isopropyl alcohol. Use the cloth that has been dampened with isopropyl alcohol to begin scrubbing off the stain. You’ll know the alcohol is working if the stain begins to transfer to the cloth. Continue to scrub until the stain is gone and relief begins to wash over you.[5]X Research source 1 4 Rinse and dry the wood. Once the stain has been scrubbed off, rinse off the wood. You can pour some water on the wood and dry it off with a towel. Or, wet a fresh cloth and then let the wood air dry. You’re done! Sit back and relax.[6]X Research source  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 12,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "#1 Use Crayons and Sharpie Pens to Hide Small Scratches Take some artistic license to hide minor scratches in wood floors by rubbing on stain-matching crayons and Sharpie pens. Wax sticks, such as Minwax Stain Markers, are great scratch busters because they include stain and urethane, which protects the floor’s finish. Don’t be afraid to mix a couple of colors together to get a good match. And don’t sweat if the color is a little off. Real hardwoods mix several hues and tones. So long as you cover the contrasting “white” scratches, color imperfections will match perfectly.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 13,
      "file_path": "https://www.houselogic.com/organize-maintain/diy-repair/repair-wood-floors-and-erase-ugly-scratches/"
    },
    {
      "content": "#2 Use Homemade Polish to Camouflage Scratches Mix equal parts olive oil and vinegar, which work together to remove dirt, moisturize, and shine wood. Pour a little directly onto the scratch. Let the polish soak in for 24 hours, then wipe off. Repeat until the scratch disappears. #3 Spot-Sand Deep Scratches It takes time to repair wood gouges: Sand, fill, sand again, stain, and seal. Here are some tips to make the job go faster. 1 Sand with fine-gauge steel wool or lightweight sandpaper. 2 Always sand with the grain. 3 Use wood filler, which takes stain better than wood putty. 4 Use a plastic putty knife to avoid more scratches. 5 Seal the area with polyurethane, or whatever product was used on the floor originally. 6 Apply the polyurethane coat with a lambs wool applicator, which avoids air bubbles in the finish.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 14,
      "file_path": "https://www.houselogic.com/organize-maintain/diy-repair/repair-wood-floors-and-erase-ugly-scratches/"
    },
    {
      "content": "Avoiding Discoloration in Wood Floors Discolouration in wood floors is a common issue predominantly caused by factors such as UV exposure, spills, and pet urine. When wood floors are exposed to strong sunlight over time, the UV rays initiate a process called oxidation, which alters the wood’s natural colour, often darkening it. Additionally, accidental spills and pet urine can leave stains that penetrate the wood, further contributing to discolouration. These changes not only affect the aesthetic appeal of the flooring but can also highlight areas of neglect over time. To combat these issues, several solutions can be implemented to maintain the pristine appearance of wood floors. Applying UV-blocking treatments or sealants can significantly reduce the impact of sunlight, preserving the floor’s original hue. Regular polishing is also beneficial as it helps maintain the finish, providing a protective layer that can resist stains. For existing stains, gentle sanding followed by reapplication of the finish can help restore the affected area to match the rest of the floor.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 15,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Advertisement Expert Q&A 1 Search Add New QuestionQuestion How do you get ink off the floor? Michelle Driscoll, MPH Professional Cleaner Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. Michelle Driscoll, MPHProfessional Cleaner Expert Answer There are many ways to get ink off of the floor. You can start with the toothpaste method—apply some toothpaste to the stain, then rub it with a cloth and rinse the area. If the stain is still present, repeat the process. Thanks! We're glad this was helpful.Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow YesNoNot Helpful 3Helpful 0 2 Question How do you get ink off of hardwood floors? Michelle Driscoll, MPH Professional Cleaner Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. Michelle Driscoll, MPHProfessional Cleaner Expert Answer You can apply toothpaste or rubbing alcohol to the stained area. Scrub it with a cloth, rinse the floor, and repeat the process if necessary. Alternatively, you can try to use bleach on the stain if the other methods do not work. Mix some bleach and hot water, apply it to the stain, and let it sit for about 10 minutes. Then, put some distilled white vinegar over the bleach and rinse the area with water. If the bleach has discolored the wood, you can apply a light wood stain to the area. Thanks! We're glad this was helpful.Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow YesNoNot Helpful 1Helpful 0  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 16,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": " Submit a Tip All tip submissions are carefully reviewed before being published Name Please provide your name and last initial Submit Thanks for submitting a tip for review! Advertisement Warning 1 Do not apply ammonia to a hardwood floor. The floor can discolor when it gets in contact with ammonia. 2 Do not use a mop to remove the ink spill on the floor. This will just spread the stain as the ink gets into the fibers of the mop. Things You'll Need 1 Soft cloths 2 Cloth or paper towels 3 Toothpaste 4 Toothbrush 5 Baking soda 6 Isopropyl alcohol 7 Chlorine bleach 8 Wood stain 9 Hydrogen peroxide (optional) 10 Hairspray (optional)  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 17,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "See more answersAsk a Question 200 characters left Include your email address to get a message when this question is answered. SubmitAdvertisement Tips 1 If you determine that your floor finish easily gets stained, you might want to consider refinishing the entire floor. Thanks Helpful 0 Not Helpful 0 2 No matter what you’re using, test the solution first on a small hidden area of the floor. This is to make sure it doesn’t cause damage before using the solution on the actual stain. Thanks Helpful 0 Not Helpful 0 3 Make a paste of baking soda and water and let it sit on the stain for 10 minutes before you scrub the paste away. Thanks Helpful 0 Not Helpful 0  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 18,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Method 3 Method 3 of 3: Using Chlorine Bleach 1 Download Article 1 Choose laundry or swimming pool bleach. Bleach is a strong chemical, but it’s definitely an effective method for stain removal. Keep in mind that this may lead to some discoloration, but that can be fixed. A basic laundry bleach can be used, but it may not be strong enough to remove a deep stain. A swimming pool bleach, like Shock Treatment, is stronger and more likely to work. 2 2 Mix the bleach with hot water. At this point, it’s a good idea to put on a pair of rubber gloves for protection. Take a cup, bucket, or something you won’t be drinking out of, and fill it with hot water. Pour the bleach crystals in the water until you have a saturated mixture. 1 3 Apply the solution to the stain. Pour some of the bleach mixture directly on the ink stain. Apply the bleach with a soft cloth if you’re nervous about pouring too much bleach on the floor. Let it sit for about 10 minutes. It should work quickly. If not, try again. And if you still see the stain, let it sit overnight.[7]X Trustworthy SourceU.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to sourceYou can also apply the bleach with a soft-bristle toothbrush. Just make sure you will never use that toothbrush again! 0 4 Neutralize the bleach with vinegar. After you’ve applied the bleach, pour a little bit of distilled white vinegar on top of the (formally) stained area. This will neutralize the area where you applied the bleach. Basically, it will keep bleach droplets from rising to the surface after you’ve finished cleaning. 1 5 Rinse the surface with water. Use a wet rag to rinse off the area. Scrub for a few minutes to make sure that you’ve removed all of the bleach and vinegar. Then, let the wood dry overnight.[8]X Trustworthy SourceU.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to source 2 6 Apply a light wood stain if necessary. This is one of the weaker wood bleaches, but you still might notice some discoloration. Again, don’t panic. Sand down the area and apply a light wood stain. Then, reapply the finish. Your floor should look like new again.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 19,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Hardwood Floor Refinishing The risk of scratching or denting your floors is no reason not to opt for hardwood. Stunning hardwood flooring remains one of the best flooring material options on the market, and when properly maintained will beautify your home for decades (not to mention add resale value, if you ever plan to sell down the road). For the unavoidable and accidental dents and scratches put into a floor, you can always have your hardwood floors professionally repaired and refinished. Whether the imperfections can simply be sanded out or individual boards need replacement, the process is definitely doable.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 20,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "As a solution for dents in hardwood, the National Wood Flooring Association counsels, “Remove and repair the damaged boards. The entire floor may need to be re-sanded and refinished.” In fact, hardwood floor refinishing is recommended at least once or twice a decade, even if your floors are in relatively good condition. Periodic refinishing will help preserve your floor and extend its longevity. Here at Denver Dustless, our virtually dustless hardwood refinishing process can successfully remove even some of the most stubborn gouges and scrapes. Our state-of-the-art equipment, generations of experience, and long rapport of satisfied Denver homeowners give you confidence in our best-in-the-business services.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 21,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Buffing [edit] Generally, older solid hardwood floors need to be buffed every 3–5 years. The process usually takes about one day. Buffing refers to the process of using a stand up floor buffer. The floor is abraded with 180 grit screen on the buffer. This allows for the new coat of finish to mechanically adhere to the floor. This process works with great results as long as the floor hasn't had any waxes or synthetic cleaners. Factory finished floors do not require buffing. Refinishing [edit] Refinishing is sanding the finish off old wood floors and smoothing them out. In most cases, only as little as 1/32-inch of wood is needed for refinishing. Hardwood floors specifically are known for their longevity, so it can be challenging to determine when they need to be refinished. Typically, floors that are more than 10 years old will need refinishing. Though, other signs the wood needs work include: visible scratches and nicks, a dull finish, and uneven coloring.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 22,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "No shoes – It’s always a good idea to instate a ‘shoes off’ policy for anyone who walks through your door, and not just because it’s polite. Shoes can bring in dirt and have rough edges that lead to scratching. Removing high heels and any other shoes will prolong and protect the ‘like new’ look of your floor. Felt pads – Applying felt furniture pads underneath the legs of your furniture and bottom of appliances is a cheap and easy fix. It may even save you hundreds or even thousands of dollars in premature floor refinishing and replacement down the road. These can be found at any local hardware store and are easily applied. Felt furniture pads allow items such as dining chairs to slide easily across the floor without damaging it. Just make sure they are stuck on securely, and be quick to replace any felt pads that appear loose. Avoid placing heavy items on wheels.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 23,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Cures for Hardwood Flooring Dents Taking the time to follow just a few simple preventative tips can go far in helping protect your gorgeous hardwood from becoming an eye soar. Area rugs – Lay down area rugs in high-traffic areas of your home or underneath large furniture items. For example, be sure your hallway, entryway, and living room have rugs, and perhaps even a couple in the kitchen at the sink and below the countertop where you do your food prep. Buying rugs may add an extra cost and even an extra step when it comes to cleaning your floor, but the savings that result from protecting your floor will pay off in the long run. As a word of caution, ensure that when you lay down the rug there are no pebbles or debris between the rug and the floor that could create scratching potential. Some area rug backing is even scratchy, so laying down a pad between it and the hardwood is recommended.  ",
      "source_id": "Source_wood4",
      "source_chunk_index": 24,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "● Water Stains: Often caused by spilled drinks or wet shoes. ● Oil Stains: Typically come from food spills, such as cooking oil or greasy residues. ● Ink Stains: Usually result from pens or markers being accidentally dropped on the floor. ● Pet Stains: Caused by pet accidents, which can leave both a stain and an odour. Use the Right Wood Stain Remover Once you know the type of stain, it’s time to select a suitable wood stain remover. For general stains, a high-quality cleaner can work wonders. Treatex offers a range of wooden floor products designed to clean and maintain your flooring without damaging the finish.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 0,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring"
    },
    {
      "content": "1 Skip to content01823 674562 2 info@ryansrestoration.co.uk 1 01823 674562 2 info@ryansrestoration.co.uk 0 Menu Our Guides Domestic and Commercial Floor Sanding. QUICK QUOTATION 7 Common Wood Floor Problems Solved Expertly 1 November 8, 2024 When it comes to wood flooring, are you finding more problems than beauty in your home? The allure of hardwood can quickly fade if plagued by scratches, water damage, cupping, gaps, buckling, discolouration, or creaks. Fortunately, each issue can be expertly resolved. From managing scratches inflicted by everyday mishaps to addressing the buckling caused by moisture, understanding these common problems is the first step to maintaining elegance and value in your living space. Read on for Professional insights and solutions from Ryan’s Restoration that ensure a polished, problem-free wood floor.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 1,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Tackling Floor Buckling and Warping Buckling and warping are significant issues that can compromise the integrity and appearance of wood floors. Buckling occurs when floor planks lift off the subfloor, often due to excessive moisture infiltrating the wood. This moisture can originate from sources such as floods, leaks, or high humidity levels. Warping, on the other hand, involves changes in the shape of the wood itself, typically resulting from uneven moisture absorption or rapid drying. Both problems can lead to uneven surfaces and potential structural damage if not addressed promptly.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 2,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Addressing Water Damage to Wood Floors Water damage is a crucial concern for wood flooring, as it can lead to severe structural issues such as buckling and swelling. When excess moisture infiltrates the wood, it causes the planks to expand unevenly. This expansion can compromise the integrity of the floor, leading to lifted sections and distorted surfaces. Additionally, prolonged exposure to moisture can encourage the growth of mould and mildew, further damaging the wood and creating potential health hazards.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 3,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Solutions for Wood Floor Cupping Wood floor cupping is a common issue that arises when the wood absorbs excess moisture, leading to the edges of the planks rising above the centre and creating a concave shape. This moisture imbalance is often due to high humidity levels in the environment or moisture seeping up from the subfloor. Poor ventilation, leaks, and improper acclimation of the wood before installation can exacerbate the problem, causing the wood to expand unevenly and distort its natural shape. Addressing wood floor cupping requires a combination of immediate and long-term strategies. One effective solution is to ensure that the wood is properly acclimated to the indoor environment before installation, allowing it to adjust to the home’s humidity levels. Using moisture meters can help monitor the moisture content in the wood, ensuring it remains within an acceptable range. If cupping occurs, drying out the affected area gradually can help the wood return to its original state. Dehumidifiers and fans can be employed to reduce ambient moisture and stabilise the flooring. If necessary, sanding and refinishing the floor may be required once the moisture levels are balanced.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 4,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "5. Wide Gaps A little separation between boards is fine, but abnormally wide gaps typically indicate improper installation. Wood expands during humid weather and contracts during dry periods, so any gaps in your floors will appear larger during some seasons than others. If boards were excessively wet during installation, the gaps between them will be wider when they dry, causing a cosmetic issue. 6. Cupped Edges Cupping is a form of water damage. Cupped boards are those whose edges are raised higher than their center. This can happen when wood flooring is installed over a wet subfloor, but high relative humidity can also be the cause. Sometimes floors will flatten out as the excess moisture evaporates, but other cases require sanding.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 5,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "7. Crowning Edges Crowning is the inverse of cupping, with the center of a board lifting higher than its edges. Where cupping often results from moisture beneath the boards, crowning tends to happen when water is left sitting on top of the boards. Crowning can also happen when cupped floors are sanded before the moisture is addressed. 8. Buckling Boards Buckling is the third and most extreme way that wood flooring may react to moisture. When a floor buckles, the boards lift up several inches. Buckling most often results from flooding, but other moisture problems can also cause buckling if the boards were installed too close together and don’t have room to expand, or if the boards were improperly fastened to the floor. ",
      "source_id": "Source_wood5",
      "source_chunk_index": 6,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Spills happen. You may knock over a bottle of ink after working on a project for hours on end. Or, you come home after a long day to find that your kids have created a work of art on your beautiful hardwood floors. Take a deep breath and focus on getting that stain up as soon as possible. Then, consider the depth of the stain so that you can determine what method will work best for you. Next, get to work so your wood floors can quickly return to a stain-free and stress-free condition. Steps Method 1 Method 1 of 3:  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 7,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Avoiding Discoloration in Wood Floors Discolouration in wood floors is a common issue predominantly caused by factors such as UV exposure, spills, and pet urine. When wood floors are exposed to strong sunlight over time, the UV rays initiate a process called oxidation, which alters the wood’s natural colour, often darkening it. Additionally, accidental spills and pet urine can leave stains that penetrate the wood, further contributing to discolouration. These changes not only affect the aesthetic appeal of the flooring but can also highlight areas of neglect over time. To combat these issues, several solutions can be implemented to maintain the pristine appearance of wood floors. Applying UV-blocking treatments or sealants can significantly reduce the impact of sunlight, preserving the floor’s original hue. Regular polishing is also beneficial as it helps maintain the finish, providing a protective layer that can resist stains. For existing stains, gentle sanding followed by reapplication of the finish can help restore the affected area to match the rest of the floor.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 8,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "2. Pet Stains Although wood floors are fairly stain resistant, they’re not invincible. Water spills and pet accidents that are left unnoticed for too long will leave a mark. Pet stains, in particular, have a tendency to soak through the finish and into the wood fibers. Unlike surface stains, which can be removed with a wood-floor cleaner, stains in the finish must be sanded out. The deepest stains may even require you to use wood bleach or to replace the affected boards. 3. Sun Fading Some types of wood are more photosensitive than others, which means they are more likely to be affected by exposure to sunlight. Due to photosensitivity, wood floors may fade and change color over time. A high-quality finish can help delay this process, but if you’re worried about fading, installing blinds to limit sun exposure is also a good idea.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 9,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Wooden floors add warmth and elegance to any space, but they can be susceptible to stains from spills, foot traffic, and everyday wear and tear. Knowing how to effectively remove these stains is essential for maintaining the beauty of your wood flooring. In this guide, we’ll share practical tips on using the right wood stain remover and Treatex floor care products to restore your floors to their former glory. Identify the Type of Stain Before tackling a stain, it’s crucial to identify its type as the type of stain will help you choose the most effective removal method. Common stains include:  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 10,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring"
    },
    {
      "content": "See more answersAsk a Question 200 characters left Include your email address to get a message when this question is answered. SubmitAdvertisement Tips 1 If you determine that your floor finish easily gets stained, you might want to consider refinishing the entire floor. Thanks Helpful 0 Not Helpful 0 2 No matter what you’re using, test the solution first on a small hidden area of the floor. This is to make sure it doesn’t cause damage before using the solution on the actual stain. Thanks Helpful 0 Not Helpful 0 3 Make a paste of baking soda and water and let it sit on the stain for 10 minutes before you scrub the paste away. Thanks Helpful 0 Not Helpful 0  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 11,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "For Water Stains: Mix a solution of equal parts vinegar and water. Dampen a cloth with the mixture and gently rub the stain. Wipe dry with a clean cloth and check if the stain has lifted. For Oil Stains: Sprinkle baking soda on the stain, then dampen it with a few drops of water. Let it sit for a few hours, then gently scrub it with a soft cloth and wipe it clean. For Ink Stains: Use a cotton ball soaked in rubbing alcohol. Dab the ink stain gently until it lifts. Be careful not to saturate the wood; excess moisture can cause damage.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 12,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring"
    },
    {
      "content": "Removing the Stain with Toothpaste 1 Download Article 1 Blot the stain. You may feel the need to panic and wipe up the stain, but resist that temptation! Wiping up the stain without the use of a cleaner can lead to an even bigger stain. If possible, blot up some of the ink with a paper towel. Just press the ink stain until you can’t remove any more of the ink with blotting alone. 1 2 Apply the toothpaste to the stain. The kind of toothpaste you use to brush your teeth should work just fine—unless you use gel toothpaste. In that case, get some basic toothpaste that can even be bought from the dollar store. Put the toothpaste directly on the ink stain.[1]X Research source Find a toothpaste that is labeled for whitening or has baking soda in it. This helps clear the stain. 0 Advertisement 1 3 Rub the stain with a cloth. Okay, now you can start wiping instead of blotting. First, dampen a clean, soft cloth. Rub the stain for a few minutes. You’re ready to stop rubbing when the cloth slides over the wood with ease.[2]X Research source 2 4 Rinse off the wood. Check the wood out to see if most or all of the stain is gone. Then, rinse off the rag you just used to clean the floor. Use that same cloth to rinse off the floor. Wipe off the wood until there isn’t any toothpaste left on the floor. Use a towel to pat off the wood until it is dry. 3 5 Repeat the process if necessary. Look over the result of your hard work. At this point, the stain should be completely gone. If not, don’t stress! There are other things you can do. You can repeat the process until you get the result you want. Or, you can use a stronger chemical to get the job done.[3]X Research source  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 13,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Expert Q&A 1 Search Add New QuestionQuestion How do you get ink off the floor? Michelle Driscoll, MPH Professional Cleaner Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. Michelle Driscoll, MPHProfessional Cleaner Expert Answer There are many ways to get ink off of the floor. You can start with the toothpaste method—apply some toothpaste to the stain, then rub it with a cloth and rinse the area. If the stain is still present, repeat the process. Thanks! We're glad this was helpful.Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow YesNoNot Helpful 3Helpful 0 2 Question How do you get ink off of hardwood floors? Michelle Driscoll, MPH Professional Cleaner Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. Michelle Driscoll, MPHProfessional Cleaner Expert Answer You can apply toothpaste or rubbing alcohol to the stained area. Scrub it with a cloth, rinse the floor, and repeat the process if necessary. Alternatively, you can try to use bleach on the stain if the other methods do not work. Mix some bleach and hot water, apply it to the stain, and let it sit for about 10 minutes. Then, put some distilled white vinegar over the bleach and rinse the area with water. If the bleach has discolored the wood, you can apply a light wood stain to the area. Thanks! We're glad this was helpful.Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow YesNoNot Helpful 1Helpful 0  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 14,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Method 2 Method 2 of 3: Cleaning with Isopropyl Alcohol Download Article 1 Pour isopropyl alcohol on a cloth. You can begin with a milder method, or start with this one if you don’t want to take your chances on leaving the stain for too long. It’s also an option to use a clear alcohol, like vodka, if you don’t have isopropyl alcohol around. Just try not to drink any of it while you clean. 1 Nail polish remover and hydrogen peroxide will work similarly to isopropyl alcohol. 1 2 Test the surface of the wood. Don’t start working on the stain just yet. Instead, find a hidden or small spot on the wood floor. Dab the cloth on a very small spot to make sure it doesn’t damage the wood. If it does, abandon this method now. It’s okay. There’s another way to remove the stain.[4]X Research source It is still an option to use the alcohol even if it does slightly discolor the wood. You could just sand it down and go over the floor with a wood stain to make it like new again. 0 3 Wipe off the stain with a cloth and isopropyl alcohol. Use the cloth that has been dampened with isopropyl alcohol to begin scrubbing off the stain. You’ll know the alcohol is working if the stain begins to transfer to the cloth. Continue to scrub until the stain is gone and relief begins to wash over you.[5]X Research source 1 4 Rinse and dry the wood. Once the stain has been scrubbed off, rinse off the wood. You can pour some water on the wood and dry it off with a towel. Or, wet a fresh cloth and then let the wood air dry. You’re done! Sit back and relax.[6]X Research source  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 15,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Method 3 Method 3 of 3: Using Chlorine Bleach 1 Download Article 1 Choose laundry or swimming pool bleach. Bleach is a strong chemical, but it’s definitely an effective method for stain removal. Keep in mind that this may lead to some discoloration, but that can be fixed. A basic laundry bleach can be used, but it may not be strong enough to remove a deep stain. A swimming pool bleach, like Shock Treatment, is stronger and more likely to work. 2 2 Mix the bleach with hot water. At this point, it’s a good idea to put on a pair of rubber gloves for protection. Take a cup, bucket, or something you won’t be drinking out of, and fill it with hot water. Pour the bleach crystals in the water until you have a saturated mixture. 1 3 Apply the solution to the stain. Pour some of the bleach mixture directly on the ink stain. Apply the bleach with a soft cloth if you’re nervous about pouring too much bleach on the floor. Let it sit for about 10 minutes. It should work quickly. If not, try again. And if you still see the stain, let it sit overnight.[7]X Trustworthy SourceU.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to sourceYou can also apply the bleach with a soft-bristle toothbrush. Just make sure you will never use that toothbrush again! 0 4 Neutralize the bleach with vinegar. After you’ve applied the bleach, pour a little bit of distilled white vinegar on top of the (formally) stained area. This will neutralize the area where you applied the bleach. Basically, it will keep bleach droplets from rising to the surface after you’ve finished cleaning. 1 5 Rinse the surface with water. Use a wet rag to rinse off the area. Scrub for a few minutes to make sure that you’ve removed all of the bleach and vinegar. Then, let the wood dry overnight.[8]X Trustworthy SourceU.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to source 2 6 Apply a light wood stain if necessary. This is one of the weaker wood bleaches, but you still might notice some discoloration. Again, don’t panic. Sand down the area and apply a light wood stain. Then, reapply the finish. Your floor should look like new again.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 16,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "For Pet Stains: Clean the area with a solution of mild dish soap and water. Blot the area with a cloth until the stain lifts, then rinse with clean water. Maintain Your Wood Floors with Treatex Floor Care After successfully removing stains, maintaining your wooden floors is essential to prevent future issues. Treatex floor care products provide excellent solutions for regular cleaning and protection. Use a suitable wood cleaner specifically designed for wooden floors, and consider applying Treatex Oil to enhance and protect the finish of your floor. Regular maintenance can prolong the life of your wood flooring and keep it looking beautiful. ",
      "source_id": "Source_wood5",
      "source_chunk_index": 17,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring"
    },
    {
      "content": " Submit a Tip All tip submissions are carefully reviewed before being published Name Please provide your name and last initial Submit Thanks for submitting a tip for review! Advertisement Warning 1 Do not apply ammonia to a hardwood floor. The floor can discolor when it gets in contact with ammonia. 2 Do not use a mop to remove the ink spill on the floor. This will just spread the stain as the ink gets into the fibers of the mop. Things You'll Need 1 Soft cloths 2 Cloth or paper towels 3 Toothpaste 4 Toothbrush 5 Baking soda 6 Isopropyl alcohol 7 Chlorine bleach 8 Wood stain 9 Hydrogen peroxide (optional) 10 Hairspray (optional)  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 18,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Immediate DIY solutions for tackling buckling and warping involve addressing the moisture problem quickly. For minor buckling, drying out the affected area using fans or dehumidifiers can help stabilize the wood. It’s crucial to ensure that all sources of moisture are eliminated to prevent further issues. For warped floors, gradual drying is necessary to avoid additional stress on the wood. Avoid using excessive heat, as it can exacerbate the problem by causing the wood to dry too quickly and crack. ",
      "source_id": "Source_wood5",
      "source_chunk_index": 19,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Expert solutions to combat water damage involve immediate action to remove moisture and prevent further deterioration. One effective method is the use of dehumidifiers to reduce ambient humidity and draw excess moisture from the floor. Immediate drying with fans or specialised drying equipment can also help stabilise the affected area. For severe cases, professionals may need to remove the damaged sections, replace them, and ensure the subfloor is thoroughly dried to prevent recurrence. Preventative measures are essential to protect wood floors from water damage. Installing moisture barriers beneath the flooring can significantly reduce the risk of moisture infiltration from below. Regular inspections by professionals like Ryan’s Restoration can help identify potential issues early, allowing for timely interventions. Additionally, maintaining a stable indoor climate with controlled humidity levels and promptly addressing spills will contribute to the longevity and condition of the wood floor.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 20,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "1 Use furniture pads under the legs to prevent scratches. 2 Implement regular cleaning routines to remove abrasive dirt and debris. 3 Trim pets’ nails regularly to minimise surface damage. 4 Avoid dragging heavy objects across the floor. 5 Use area rugs in high-traffic zones for added protection. For severe damage, where scratches are deep and widespread, it is advisable to consult professionals such as Ryan’s Restoration. Experts have the necessary tools and expertise to handle extensive repairs, ensuring that the floor not only looks pristine but also maintains its structural integrity. Professional intervention can often save time and prevent further damage, making it a wise investment for significant issues.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 21,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "1 Maintain even humidity levels within the home year-round. 2 Ensure proper subfloor ventilation to allow moisture to escape. 3 Use moisture barriers during installation to prevent moisture from reaching the wood. 4 Regular inspections should be conducted to catch early signs of moisture imbalance. For severe cases of cupping, consulting professional services like Ryan’s Restoration is highly recommended. These experts can diagnose the underlying cause of the moisture imbalance and offer tailored solutions to rectify the issue. Their expertise in handling complex cases ensures that the wood floor is restored to its optimal condition, preserving its aesthetic appeal and structural integrity for the long term.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 22,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "For severe cases of buckling and warping, professional intervention is often required to achieve effective and lasting repairs. Consulting experts such as Ryan’s Restoration can provide comprehensive solutions tailored to the specific conditions of the floor. Professionals have the expertise to assess the extent of the damage, remove and replace affected sections if necessary, and ensure that the underlying causes are addressed to prevent recurrence. Engaging with professional services not only restores the floor’s structural integrity but also enhances its longevity and visual appeal. ",
      "source_id": "Source_wood5",
      "source_chunk_index": 23,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "4. Peeling Finish Although all finishes will eventually show signs of wear, subpar or improperly applied finishes will deteriorate much sooner. If your finish starts to peel off in places, that’s a sure sign that something went wrong during application — and you’ll probably have to sand everything down and start again. Typically, a peeling finish indicates that dirt or chemicals, such as stain residue, were not removed before applying the stain. These contaminants prevent the wood from holding its finish.  ",
      "source_id": "Source_wood5",
      "source_chunk_index": 24,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "0 Johnson Hardwood 0 Johnson Hardwood COLOR VARIATION When deciding on a wood species for your hardwood floor it is important to keep in mind color variation. With wood being a natural material it brings with it natural characteristics that can not be controlled. These characteristics are a by-product of the species itself, and is hopefully one of the reasons the decision has been made to purchase hardwood flooring. Some wood species have less color variation than others. This should be completely explained to you by your flooring dealer when narrowing down your decision. Color variation can be attributed to two natural occurances. First, is the natural color of the raw wood, and second is the way the wood absorbs stain. The following photos are examples of the different levels of color variation that one can expect from the wood species that we carry.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 0,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "BOARD VARIATION & COLOR CHANGE Wood is a natural product and will vary in color and grain appearance from board to board. This is a natural aspect of the wood. Texture, including grain, knots, natural imperfections and character will vary significantly from board to board. Exposure to UV rays from sunlight, florescent, LED and incandescent bulbs can change and add patina to each board. Window coverings, UV resistant tint, and solar screens can minimize but not eliminate this natural occurrence. Certain species are more susceptible to light and development of varying degrees and shades of patina, due to their high content of natural oils & tannins.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 1,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "HIGH COLOR VARIATION Hardwood floors with High Color Variation will range from light to dark wood pieces, and have lots of wood character. When board colors are mixed correctly during the installation the flooring pattern is very dynamic and will reflect differently under various light sources. MEDIUM COLOR VARIATION Floors with Low or Medium Color Variation are even toned. There are certain wood species like Birch, and in some instances Maple, that have tame grain patterns and even color tones so that the appearance of the floor is one continuous color. However, with wood there will still be some color variation due to the natural qualities of wood and its uncontrollable uniqueness.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 2,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "Avoiding Discoloration in Wood Floors Discolouration in wood floors is a common issue predominantly caused by factors such as UV exposure, spills, and pet urine. When wood floors are exposed to strong sunlight over time, the UV rays initiate a process called oxidation, which alters the wood’s natural colour, often darkening it. Additionally, accidental spills and pet urine can leave stains that penetrate the wood, further contributing to discolouration. These changes not only affect the aesthetic appeal of the flooring but can also highlight areas of neglect over time. To combat these issues, several solutions can be implemented to maintain the pristine appearance of wood floors. Applying UV-blocking treatments or sealants can significantly reduce the impact of sunlight, preserving the floor’s original hue. Regular polishing is also beneficial as it helps maintain the finish, providing a protective layer that can resist stains. For existing stains, gentle sanding followed by reapplication of the finish can help restore the affected area to match the rest of the floor.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 3,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Wooden floors add warmth and elegance to any space, but they can be susceptible to stains from spills, foot traffic, and everyday wear and tear. Knowing how to effectively remove these stains is essential for maintaining the beauty of your wood flooring. In this guide, we’ll share practical tips on using the right wood stain remover and Treatex floor care products to restore your floors to their former glory. Identify the Type of Stain Before tackling a stain, it’s crucial to identify its type as the type of stain will help you choose the most effective removal method. Common stains include:  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 4,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring "
    },
    {
      "content": "● Water Stains: Often caused by spilled drinks or wet shoes. ● Oil Stains: Typically come from food spills, such as cooking oil or greasy residues. ● Ink Stains: Usually result from pens or markers being accidentally dropped on the floor. ● Pet Stains: Caused by pet accidents, which can leave both a stain and an odour. Use the Right Wood Stain Remover Once you know the type of stain, it’s time to select a suitable wood stain remover. For general stains, a high-quality cleaner can work wonders. Treatex offers a range of wooden floor products designed to clean and maintain your flooring without damaging the finish.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 5,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring "
    },
    {
      "content": "Streaks – mineral streaks are created as sap transports food and in oak flooring they can be just as natural-looking as grains. In fact, streaks less than 6” in length are allowed even in Clear / 1st grade flooring. Milling Imperfections – while some ‘defects’ actually enhance the look of the wood because they are imperfections that result from nature, milling blemishes do not fit that bill. There are marks on the wood such as machine burn, cut marks, and gouges that result from turning lumber into useable wood. Slight imperfections can usually be sanded out and are thus allowed in Clear / 1st grade flooring but the more severe they appear, the more likely they are to drop the wood down a grade.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 6,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "To download our grading standard you can click here: Wideplank Oak Grading Standard 1 file(s) 497.83 KB Please login to download What defines a ‘minor’ blemish from a significant one bears some argument but it’s good to know the groundwork of what defines each class. Some of those blemishes or defects include: Burls – a burl on the oak tree itself is a very bulbous growth that results from some sort of stress whether it be a fungus, virus, or injury. The twisted and deformed burl wood is actually very desirable in furniture making and in sculptures with many thieves even going so far as cutting down, stealing, and selling the trees. Burls appear as swirls or twists in wood but are still allowed small and occasionally in Clear / 1st grade.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 7,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Splits – as wood dries it can separate from itself which is known as a split. This typically happens lengthwise (with the grain) and is not acceptable in Clear or Select grade oak as the crack is very liable to grow. Sticker Stain – stickers are strips of wood that are used to separate multiple boards as they are stacked for drying. When the wood dries slowly under high temperatures a gray stain occurs, sometimes only present after planing the board. Sticker stains do not present a natural-looking defect and are thus usually only allowed in Common grade oak.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 8, 
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "KNOTS & FILLERS Natural wood products can exhibit certain characteristics that are inherent to wood, such as filled knots/cracks and/or checks. These imperfections are a result of nature’s influence on the growth and development of the tree. However, these natural features can enhance the beauty of the flooring and make it stand out. To highlight these unique characteristics, some knots/cracks and/or checks may be filled with a color that may appear darker or lighter than the overall hue and tone of the plank. This deliberate contrast draws attention to the natural elements of the wood, adding to the overall aesthetic appeal of the surface.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 9,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "1 Use area rugs to shield high-traffic and sun-exposed areas. 2 Rearrange furniture periodically to ensure even exposure to light. 3 Implement a no-shoes policy indoors to minimise spill and dirt exposure. Consulting professionals like Ryan’s Restoration are advisable for significant discolouration that cannot be addressed with DIY methods. These experts have the tools and experience necessary to assess and treat severe discolouration issues effectively. They can provide tailored solutions that not only restore the floor’s appearance but also enhance its durability and resistance to future discolouration, ensuring the wood floor remains a timeless feature of the home.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 10,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": " Submit a Tip All tip submissions are carefully reviewed before being published Name Please provide your name and last initial Submit Thanks for submitting a tip for review! Advertisement Warning 1 Do not apply ammonia to a hardwood floor. The floor can discolor when it gets in contact with ammonia. 2 Do not use a mop to remove the ink spill on the floor. This will just spread the stain as the ink gets into the fibers of the mop. Things You'll Need 1 Soft cloths 2 Cloth or paper towels 3 Toothpaste 4 Toothbrush 5 Baking soda 6 Isopropyl alcohol 7 Chlorine bleach 8 Wood stain 9 Hydrogen peroxide (optional) 10 Hairspray (optional)  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 11,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "For Water Stains: Mix a solution of equal parts vinegar and water. Dampen a cloth with the mixture and gently rub the stain. Wipe dry with a clean cloth and check if the stain has lifted. For Oil Stains: Sprinkle baking soda on the stain, then dampen it with a few drops of water. Let it sit for a few hours, then gently scrub it with a soft cloth and wipe it clean. For Ink Stains: Use a cotton ball soaked in rubbing alcohol. Dab the ink stain gently until it lifts. Be careful not to saturate the wood; excess moisture can cause damage.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 12,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring "
    },
    {
      "content": "See more answersAsk a Question 200 characters left Include your email address to get a message when this question is answered. SubmitAdvertisement Tips 1 If you determine that your floor finish easily gets stained, you might want to consider refinishing the entire floor. Thanks Helpful 0 Not Helpful 0 2 No matter what you’re using, test the solution first on a small hidden area of the floor. This is to make sure it doesn’t cause damage before using the solution on the actual stain. Thanks Helpful 0 Not Helpful 0 3 Make a paste of baking soda and water and let it sit on the stain for 10 minutes before you scrub the paste away. Thanks Helpful 0 Not Helpful 0  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 13,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Spills happen. You may knock over a bottle of ink after working on a project for hours on end. Or, you come home after a long day to find that your kids have created a work of art on your beautiful hardwood floors. Take a deep breath and focus on getting that stain up as soon as possible. Then, consider the depth of the stain so that you can determine what method will work best for you. Next, get to work so your wood floors can quickly return to a stain-free and stress-free condition. Steps Method 1 Method 1 of 3:  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 14,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Removing the Stain with Toothpaste 1 Download Article 1 Blot the stain. You may feel the need to panic and wipe up the stain, but resist that temptation! Wiping up the stain without the use of a cleaner can lead to an even bigger stain. If possible, blot up some of the ink with a paper towel. Just press the ink stain until you can’t remove any more of the ink with blotting alone. 1 2 Apply the toothpaste to the stain. The kind of toothpaste you use to brush your teeth should work just fine—unless you use gel toothpaste. In that case, get some basic toothpaste that can even be bought from the dollar store. Put the toothpaste directly on the ink stain.[1]X Research source Find a toothpaste that is labeled for whitening or has baking soda in it. This helps clear the stain. 0 Advertisement 1 3 Rub the stain with a cloth. Okay, now you can start wiping instead of blotting. First, dampen a clean, soft cloth. Rub the stain for a few minutes. You’re ready to stop rubbing when the cloth slides over the wood with ease.[2]X Research source 2 4 Rinse off the wood. Check the wood out to see if most or all of the stain is gone. Then, rinse off the rag you just used to clean the floor. Use that same cloth to rinse off the floor. Wipe off the wood until there isn’t any toothpaste left on the floor. Use a towel to pat off the wood until it is dry. 3 5 Repeat the process if necessary. Look over the result of your hard work. At this point, the stain should be completely gone. If not, don’t stress! There are other things you can do. You can repeat the process until you get the result you want. Or, you can use a stronger chemical to get the job done.[3]X Research source  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 15,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Expert Q&A 1 Search Add New QuestionQuestion How do you get ink off the floor? Michelle Driscoll, MPH Professional Cleaner Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. Michelle Driscoll, MPHProfessional Cleaner Expert Answer There are many ways to get ink off of the floor. You can start with the toothpaste method—apply some toothpaste to the stain, then rub it with a cloth and rinse the area. If the stain is still present, repeat the process. Thanks! We're glad this was helpful.Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow YesNoNot Helpful 3Helpful 0 2 Question How do you get ink off of hardwood floors? Michelle Driscoll, MPH Professional Cleaner Michelle Driscoll is a professional cleaner based in Fort Collins, Colorado. With over 7 years of experience, Michelle is the founder of Mulberry Maids, specializing in cleaning homes and small offices. Mulberry Maids services Northern Colorado, including Fort Collins and Loveland, and offers a variety of services, including commercial cleaning, move-in and move-out cleaning, and regular home cleaning. Michelle holds a Master's in Public Health from the Colorado School of Public Health. Additionally, Mulberry Maids has an A+ rating from the Better Business Bureau. Michelle Driscoll, MPHProfessional Cleaner Expert Answer You can apply toothpaste or rubbing alcohol to the stained area. Scrub it with a cloth, rinse the floor, and repeat the process if necessary. Alternatively, you can try to use bleach on the stain if the other methods do not work. Mix some bleach and hot water, apply it to the stain, and let it sit for about 10 minutes. Then, put some distilled white vinegar over the bleach and rinse the area with water. If the bleach has discolored the wood, you can apply a light wood stain to the area. Thanks! We're glad this was helpful.Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow YesNoNot Helpful 1Helpful 0  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 16,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Method 2 Method 2 of 3: Cleaning with Isopropyl Alcohol Download Article 1 Pour isopropyl alcohol on a cloth. You can begin with a milder method, or start with this one if you don’t want to take your chances on leaving the stain for too long. It’s also an option to use a clear alcohol, like vodka, if you don’t have isopropyl alcohol around. Just try not to drink any of it while you clean. 1 Nail polish remover and hydrogen peroxide will work similarly to isopropyl alcohol. 1 2 Test the surface of the wood. Don’t start working on the stain just yet. Instead, find a hidden or small spot on the wood floor. Dab the cloth on a very small spot to make sure it doesn’t damage the wood. If it does, abandon this method now. It’s okay. There’s another way to remove the stain.[4]X Research source It is still an option to use the alcohol even if it does slightly discolor the wood. You could just sand it down and go over the floor with a wood stain to make it like new again. 0 3 Wipe off the stain with a cloth and isopropyl alcohol. Use the cloth that has been dampened with isopropyl alcohol to begin scrubbing off the stain. You’ll know the alcohol is working if the stain begins to transfer to the cloth. Continue to scrub until the stain is gone and relief begins to wash over you.[5]X Research source 1 4 Rinse and dry the wood. Once the stain has been scrubbed off, rinse off the wood. You can pour some water on the wood and dry it off with a towel. Or, wet a fresh cloth and then let the wood air dry. You’re done! Sit back and relax.[6]X Research source  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 17,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "Advertisement Method 3 Method 3 of 3: Using Chlorine Bleach 1 Download Article 1 Choose laundry or swimming pool bleach. Bleach is a strong chemical, but it’s definitely an effective method for stain removal. Keep in mind that this may lead to some discoloration, but that can be fixed. A basic laundry bleach can be used, but it may not be strong enough to remove a deep stain. A swimming pool bleach, like Shock Treatment, is stronger and more likely to work. 2 2 Mix the bleach with hot water. At this point, it’s a good idea to put on a pair of rubber gloves for protection. Take a cup, bucket, or something you won’t be drinking out of, and fill it with hot water. Pour the bleach crystals in the water until you have a saturated mixture. 1 3 Apply the solution to the stain. Pour some of the bleach mixture directly on the ink stain. Apply the bleach with a soft cloth if you’re nervous about pouring too much bleach on the floor. Let it sit for about 10 minutes. It should work quickly. If not, try again. And if you still see the stain, let it sit overnight.[7]X Trustworthy SourceU.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to sourceYou can also apply the bleach with a soft-bristle toothbrush. Just make sure you will never use that toothbrush again! 0 4 Neutralize the bleach with vinegar. After you’ve applied the bleach, pour a little bit of distilled white vinegar on top of the (formally) stained area. This will neutralize the area where you applied the bleach. Basically, it will keep bleach droplets from rising to the surface after you’ve finished cleaning. 1 5 Rinse the surface with water. Use a wet rag to rinse off the area. Scrub for a few minutes to make sure that you’ve removed all of the bleach and vinegar. Then, let the wood dry overnight.[8]X Trustworthy SourceU.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to source 2 6 Apply a light wood stain if necessary. This is one of the weaker wood bleaches, but you still might notice some discoloration. Again, don’t panic. Sand down the area and apply a light wood stain. Then, reapply the finish. Your floor should look like new again.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 18,
      "file_path": "https://www.wikihow.com/Remove-Ink-from-a-Wood-Floor"
    },
    {
      "content": "2. Pet Stains Although wood floors are fairly stain resistant, they’re not invincible. Water spills and pet accidents that are left unnoticed for too long will leave a mark. Pet stains, in particular, have a tendency to soak through the finish and into the wood fibers. Unlike surface stains, which can be removed with a wood-floor cleaner, stains in the finish must be sanded out. The deepest stains may even require you to use wood bleach or to replace the affected boards. 3. Sun Fading Some types of wood are more photosensitive than others, which means they are more likely to be affected by exposure to sunlight. Due to photosensitivity, wood floors may fade and change color over time. A high-quality finish can help delay this process, but if you’re worried about fading, installing blinds to limit sun exposure is also a good idea.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 19,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "For Pet Stains: Clean the area with a solution of mild dish soap and water. Blot the area with a cloth until the stain lifts, then rinse with clean water. Maintain Your Wood Floors with Treatex Floor Care After successfully removing stains, maintaining your wooden floors is essential to prevent future issues. Treatex floor care products provide excellent solutions for regular cleaning and protection. Use a suitable wood cleaner specifically designed for wooden floors, and consider applying Treatex Oil to enhance and protect the finish of your floor. Regular maintenance can prolong the life of your wood flooring and keep it looking beautiful.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 20,
      "file_path": "https://www.treatex.co.uk/blogs/2024/10/16/effective-ways-to-remove-stains-from-wood-flooring "
    },
    {
      "content": "Solutions for Wood Floor Cupping Wood floor cupping is a common issue that arises when the wood absorbs excess moisture, leading to the edges of the planks rising above the centre and creating a concave shape. This moisture imbalance is often due to high humidity levels in the environment or moisture seeping up from the subfloor. Poor ventilation, leaks, and improper acclimation of the wood before installation can exacerbate the problem, causing the wood to expand unevenly and distort its natural shape. Addressing wood floor cupping requires a combination of immediate and long-term strategies. One effective solution is to ensure that the wood is properly acclimated to the indoor environment before installation, allowing it to adjust to the home’s humidity levels. Using moisture meters can help monitor the moisture content in the wood, ensuring it remains within an acceptable range. If cupping occurs, drying out the affected area gradually can help the wood return to its original state. Dehumidifiers and fans can be employed to reduce ambient moisture and stabilise the flooring. If necessary, sanding and refinishing the floor may be required once the moisture levels are balanced.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 21,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "5. Wide Gaps A little separation between boards is fine, but abnormally wide gaps typically indicate improper installation. Wood expands during humid weather and contracts during dry periods, so any gaps in your floors will appear larger during some seasons than others. If boards were excessively wet during installation, the gaps between them will be wider when they dry, causing a cosmetic issue. 6. Cupped Edges Cupping is a form of water damage. Cupped boards are those whose edges are raised higher than their center. This can happen when wood flooring is installed over a wet subfloor, but high relative humidity can also be the cause. Sometimes floors will flatten out as the excess moisture evaporates, but other cases require sanding.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 22,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Comparison of solid wood with engineered wood [edit] It is difficult to compare solid wood flooring to engineered wood flooring due to the wide range of quality in both product categories and each type has its limitations. Solid hardwood is more prone than engineered timber to \"gapping\" (excessive space between planks), \"crowning\" (convex curving upwards when humidity increases) and \"cupping\" (a concave or \"dished\" appearance of the plank, with the height of the plank along its longer edges being higher than the centre) with increased plank size. Patented installation systems for engineered wood may allow for faster installation and easy replacement of boards. Engineered wood also allows for a floating installation where the planks are not fastened to the subfloor, but to each other. Engineered flooring is suitable for underfloor and radiant heating systems, while solid wood cannot be used with underfloor heating.[ 6 ]  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 23,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "7. Crowning Edges Crowning is the inverse of cupping, with the center of a board lifting higher than its edges. Where cupping often results from moisture beneath the boards, crowning tends to happen when water is left sitting on top of the boards. Crowning can also happen when cupped floors are sanded before the moisture is addressed. 8. Buckling Boards Buckling is the third and most extreme way that wood flooring may react to moisture. When a floor buckles, the boards lift up several inches. Buckling most often results from flooding, but other moisture problems can also cause buckling if the boards were installed too close together and don’t have room to expand, or if the boards were improperly fastened to the floor.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 24,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Tackling Floor Buckling and Warping Buckling and warping are significant issues that can compromise the integrity and appearance of wood floors. Buckling occurs when floor planks lift off the subfloor, often due to excessive moisture infiltrating the wood. This moisture can originate from sources such as floods, leaks, or high humidity levels. Warping, on the other hand, involves changes in the shape of the wood itself, typically resulting from uneven moisture absorption or rapid drying. Both problems can lead to uneven surfaces and potential structural damage if not addressed promptly.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 25,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Tackling Floor Buckling and Warping Buckling and warping are significant issues that can compromise the integrity and appearance of wood floors. Buckling occurs when floor planks lift off the subfloor, often due to excessive moisture infiltrating the wood. This moisture can originate from sources such as floods, leaks, or high humidity levels. Warping, on the other hand, involves changes in the shape of the wood itself, typically resulting from uneven moisture absorption or rapid drying. Both problems can lead to uneven surfaces and potential structural damage if not addressed promptly.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 26,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "For severe cases of buckling and warping, professional intervention is often required to achieve effective and lasting repairs. Consulting experts such as Ryan’s Restoration can provide comprehensive solutions tailored to the specific conditions of the floor. Professionals have the expertise to assess the extent of the damage, remove and replace affected sections if necessary, and ensure that the underlying causes are addressed to prevent recurrence. Engaging with professional services not only restores the floor’s structural integrity but also enhances its longevity and visual appeal. ",
      "source_id": "Source_wood6",
      "source_chunk_index": 27,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Understanding Scratches on Wood Floors Scratches on wood floors are a frequent issue, primarily caused by everyday activities. Pets running across the flooring with their claws exposed and heavy objects being dropped inadvertently can lead to unsightly dents and scratches. These imperfections not only affect the aesthetic appeal of the floor but can also compromise its longevity if not addressed promptly. Immediate solutions for repairing scratched wood floors include the application of wood repair kits, which are readily available and user-friendly for minor abrasions. These kits typically contain wax filler sticks or touch-up markers that match the wood’s colour, allowing homeowners to conceal scratches effectively. Additionally, polishing techniques can be employed to restore the floor’s original sheen, helping to blend minor scratches with the surrounding area. For deeper scratches, sanding the affected area and applying a suitable finish may be necessary to achieve a seamless repair.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 28,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Causes of Hardwood Flooring Dents Dents result from heavy items being dropped or dragged across the floor, which compresses the fibers in the wood and results in visible damage. There is really an infinite number of ways your hardwood floor could be scratched or dented. No need to worry! Being aware of what threats exist to your floor will prepare you to protect it. Here are just a handful of common causes for scratches and dents in hardwood floors: Moving day – You may be moving into a home that already has hardwood. Congrats! Still, moving in and out of a house creates a lot of hazards for scratching and dinging up a hardwood floor. Heavy boxes and furniture could be dropped, hefty appliances may be dragged across the floor, nobody takes off their work shoes coming in and out of the house, etc. Likely no one will be as careful with your floors as you are, so if you invite a moving crew to help, they probably won’t move in furniture and boxes as gingerly as you would. Plus, who knows how well the hardwood was taken care of by previous owners? You could be moving in and inheriting all of their floor dents.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 29,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Shoes –All shoes could pose a threat to your floor, but heavy work boots, cleats, and high heels are especially at risk of scratching your hardwood. Furniture – Most furniture items have either wood, metal, or plastic legs. Any of these have potential to scratch, or even dent your hardwood. This is particularly the case if the furniture is frequently dragged across the floor, such as dining chairs or barstools. Rolling office chairs can also damage hardwood as the wheels roll along. Even your sofa can easily scoot across the floor when someone plops down on it after a long day.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 30,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "No shoes – It’s always a good idea to instate a ‘shoes off’ policy for anyone who walks through your door, and not just because it’s polite. Shoes can bring in dirt and have rough edges that lead to scratching. Removing high heels and any other shoes will prolong and protect the ‘like new’ look of your floor. Felt pads – Applying felt furniture pads underneath the legs of your furniture and bottom of appliances is a cheap and easy fix. It may even save you hundreds or even thousands of dollars in premature floor refinishing and replacement down the road. These can be found at any local hardware store and are easily applied. Felt furniture pads allow items such as dining chairs to slide easily across the floor without damaging it. Just make sure they are stuck on securely, and be quick to replace any felt pads that appear loose. Avoid placing heavy items on wheels.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 31,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Toys – Children’s toys can pose a threat to hardwood, especially in the case of toys that can be ridden on such as miniature vehicles, rocking horses, etc. These types of toys often grind along the floor and can create dents or scratches. Such toys are best used in carpeted areas of the home. Dropped objects – Items often slip out of our hands or get knocked off the counter and end up on the floor. This is mainly the case in the kitchen and pantry areas. Food cans, kitchen utensils, heavy recipe books, dinnerware, cast iron pans, and any number of things can fall to the hardwood and leave a scratch or even a sizeable dent.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 32,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Speaking of sanding, you may also notice scratches in your wood flooring that result from improper sanding. These blemishes can be introduced when worn sanding pads or abrasive screens are used to sand the boards between layers of finish. Scratches like these can only be removed by sanding past the layer where they were formed and by refinishing. 11. Cracks From Nails The concentrated force of a flooring nailer can cause unsightly cracking, especially on factory-finished floors. Some wood species are more prone to cracking than others, and cracking can happen simply because boards dried too quickly. However, nails are the most common culprit. Fortunately, many cracks can be easily fixed with wood filler.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 33,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "#1 Use Crayons and Sharpie Pens to Hide Small Scratches Take some artistic license to hide minor scratches in wood floors by rubbing on stain-matching crayons and Sharpie pens. Wax sticks, such as Minwax Stain Markers, are great scratch busters because they include stain and urethane, which protects the floor’s finish. Don’t be afraid to mix a couple of colors together to get a good match. And don’t sweat if the color is a little off. Real hardwoods mix several hues and tones. So long as you cover the contrasting “white” scratches, color imperfections will match perfectly.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 34,
      "file_path": "https://www.houselogic.com/organize-maintain/diy-repair/repair-wood-floors-and-erase-ugly-scratches/"
    },
    {
      "content": "#2 Use Homemade Polish to Camouflage Scratches Mix equal parts olive oil and vinegar, which work together to remove dirt, moisturize, and shine wood. Pour a little directly onto the scratch. Let the polish soak in for 24 hours, then wipe off. Repeat until the scratch disappears. #3 Spot-Sand Deep Scratches It takes time to repair wood gouges: Sand, fill, sand again, stain, and seal. Here are some tips to make the job go faster. 1 Sand with fine-gauge steel wool or lightweight sandpaper. 2 Always sand with the grain. 3 Use wood filler, which takes stain better than wood putty. 4 Use a plastic putty knife to avoid more scratches. 5 Seal the area with polyurethane, or whatever product was used on the floor originally. 6 Apply the polyurethane coat with a lambs wool applicator, which avoids air bubbles in the finish.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 35,
      "file_path": "https://www.houselogic.com/organize-maintain/diy-repair/repair-wood-floors-and-erase-ugly-scratches/"
    },
    {
      "content": "Hardwood Floor Refinishing The risk of scratching or denting your floors is no reason not to opt for hardwood. Stunning hardwood flooring remains one of the best flooring material options on the market, and when properly maintained will beautify your home for decades (not to mention add resale value, if you ever plan to sell down the road). For the unavoidable and accidental dents and scratches put into a floor, you can always have your hardwood floors professionally repaired and refinished. Whether the imperfections can simply be sanded out or individual boards need replacement, the process is definitely doable.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 36,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "As a solution for dents in hardwood, the National Wood Flooring Association counsels, “Remove and repair the damaged boards. The entire floor may need to be re-sanded and refinished.” In fact, hardwood floor refinishing is recommended at least once or twice a decade, even if your floors are in relatively good condition. Periodic refinishing will help preserve your floor and extend its longevity. Here at Denver Dustless, our virtually dustless hardwood refinishing process can successfully remove even some of the most stubborn gouges and scrapes. Our state-of-the-art equipment, generations of experience, and long rapport of satisfied Denver homeowners give you confidence in our best-in-the-business services.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 37,
      "file_path": "https://denverdustless.com/hardwood-flooring-dents-and-scratches-causes-and-fixes/"
    },
    {
      "content": "Buffing [edit] Generally, older solid hardwood floors need to be buffed every 3–5 years. The process usually takes about one day. Buffing refers to the process of using a stand up floor buffer. The floor is abraded with 180 grit screen on the buffer. This allows for the new coat of finish to mechanically adhere to the floor. This process works with great results as long as the floor hasn't had any waxes or synthetic cleaners. Factory finished floors do not require buffing. Refinishing [edit] Refinishing is sanding the finish off old wood floors and smoothing them out. In most cases, only as little as 1/32-inch of wood is needed for refinishing. Hardwood floors specifically are known for their longevity, so it can be challenging to determine when they need to be refinished. Typically, floors that are more than 10 years old will need refinishing. Though, other signs the wood needs work include: visible scratches and nicks, a dull finish, and uneven coloring.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 38,
      "file_path": "https://en.wikipedia.org/wiki/Wood_flooring"
    },
    {
      "content": "Expert Advice on Preventing Gaps in Wood Floors Gaps in wood floors are primarily caused by the loss of moisture, leading to shrinkage and the formation of spaces between floorboards. This phenomenon often occurs when floors are installed in conditions of high humidity and subsequently experience contraction during drier seasons. As wood is a natural material, it expands and contracts in response to changes in the surrounding environment. Seasonal fluctuations, particularly in humidity levels, are a key factor in the development of these gaps, affecting both the appearance and integrity of the flooring.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 39,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "PART 1–GENERAL 1.01 SUMMARY This specification provides guidance on filling small holes and surface cracks in wood floor boards and filling cracks between wood floor boards. Cracks the thickness of a dime between floor boards is not uncommon. In fact, plank boards may expand and contract 2-1/2 times that distance. Cracks can develop between boards from what is known as compression shrinkage or compression set. As the wood absorbs moisture, the floor boards swell. For those boards that swell beyond their allowable range, the boards compress against one another and, sometimes, become damaged. As the moisture level drops, the boards shrink and a gap develops between the boards.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 40,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "To effectively prevent gaps in wood floors, it is crucial to maintain consistent indoor humidity levels throughout the year. This can be achieved by using humidifiers during the dry winter months when indoor air tends to be less humid. Aiming for an indoor humidity level between 30% and 50% helps minimise wood contraction. Additionally, ensuring that the wood is properly acclimated to the indoor environment prior to installation can mitigate the likelihood of gapping. This acclimation process allows the wood to adjust to the average humidity levels of the space, reducing the risk of significant expansion or contraction post-installation. ",
      "source_id": "Source_wood6",
      "source_chunk_index": 41,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "Note: 1 A SPLIT is usually defined as a defect and is typically culled out during the manufacturing process. 2 A missing KNOT may not be considered a defect if it meets grade and/or if it is part of the design element (i.e., as is the case with our Grand Chateau Series). 3 CHECKS/CRACKS are usually caused during the rotary peeling process, slice cutting process and/or during the drying process. They are Not considered defects. REACTION TO ENVIRONMENTAL CONDITIONS As a natural material, wood will contract and expand as it loses and gains moisture. Some gaping between the boards during low-humidity seasons are normal and not considered a defect. Maintaining proper humidity levels of 35 to 55% will minimize this. Allowing relative humidity levels to fall below 35% can result in structural damage to the floor such as large gaps, splits in the surface, distortion of the boards and even structural failure. Humidity levels above 55% can result in surface warping and structural failure of the boards.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 42,
      "file_path": "https://johnsonhardwood.com/resources/color-variation/"
    },
    {
      "content": "#4 Use Wood Putty to Fill Gaps Old floorboards can separate over time. Fill the gaps with colored wood putty. Or, if you have some leftover planks, rip a narrow band and glue it into the gap. Related:Great-Looking, Low-Maintenance Floors Topic 1 DIY Repair 2 Improve 3 Organize & Maintain How to Prevent Freezing Pipes In DIY Repair You CAN keep pipes from freezing and avoid the costly damage that goes with it. 0 How to Prevent Freezing Pipes 12 Simple Home Repair Jobs to Lift You Out of Winter’s Funk In DIY Repair  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 43,
      "file_path": "https://www.houselogic.com/organize-maintain/diy-repair/repair-wood-floors-and-erase-ugly-scratches/"
    },
    {
      "content": "Thoroughly clean the opening of dirt and debris using a stiff bristle brush and vacuum. Slip a thin strip of wood into the crack. Match the depth of the surrounding floor and stain to match. Nail or glue the strip to only one side of the crack to allow for expansion and contraction. In extreme cases, the floorboards will have to be taken up and reinstalled. See “Replacing Damaged Floorboards” for guidance. Print Page Email Page Last updated: Aug 13, 2017 Top Glossary 1 Facebook 2 X 3 LinkedIn 4 YouTube 5 instagram 6 Blog 7 email  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 44,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "Fill with a paste filler (made by user): Mix sawdust with varnish, shellac or white glue, or Mix tissue paper, glue size, and calcined magnesia into putty. Press mixture into crack using putty knife and finish so it is level with the floor surface. Fill with a fibrous filler (made by user): Soak cloth strips in linseed oil or glue, or use strands of hemp rope (grey felt weather-stripping may also be used, but is not as stainable as hemp rope). Pack cloth strips or strands of rope (in layers, if necessary) into the crack using a screwdriver or putty knife.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 45,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "Open Checks – checking is when the boards of a wood plank are cracked, usually near the ends. This results from wood naturally seasoning but also in changes of moisture from kiln drying stress. Checks are accepted (in a reasonable amount) on Select grade finishes and below. Knots – a knot results from the formation of a twig or branch and is generally considered as much of a natural occurrence in wood as color and grain. That being said, only minimal knots are allowed in Clear grade oak wood finishes.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 46,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "Worm Holes – an Oak tree growing in the wild has natural defenses against predators but one that has been recently downed or one that is milled or in storage is very vulnerable to insects such as Powderpost beetles. These insects lay their larvae within the wood and those worms soon feed on the wood when hatched. The result is numerous holes ranging in size that looks like somebody took a poker to the surface. Small worm holes are allowed in Select / 2nd grade on down. Grub Worm Holes – whereas worm holes create symmetrically round imperfections in a dense area, grub worm holes are oblong cutouts on the surface of the flooring. Grub worm holes are definitely considered a defect and are only permitted in Common / C grade flooring and below.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 47,
      "file_path": "https://www.lordfloor.com/oak-wood-grading/"
    },
    {
      "content": "For Small Holes and Surface Cracks: Fill with commercial wood putty: Stain the putty to match the floor by using either colors-in-oils or the settled pigment from the bottom of the stain can. When staining putty to match wood, it is better to go darker than the wood rather than lighter. When filling a hole or crack, add filler in layers and allow drying time between layers. If a floorboard is splintered, glue the splinter down and fill the crack. If damage is such that it cannot be successfully filled and the board is relatively easy to remove, turn the board over rather than replacing it. The new surface should be sanded to match surrounding boards and may need to be shimmed to make it level with the existing surface.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 48,
      "file_path": "https://www.gsa.gov/real-estate/historic-preservation/historic-preservation-policy-tools/preservation-tools-resources/technical-procedures/repairing-small-holes-and-cracks-in-wood-floors"
    },
    {
      "content": "Managing and Preventing Floor Creaks Creaky floors are typically the result of issues within the subfloor or misaligned joists. These structural components can shift or settle over time, leading to friction between the floorboards and the subfloor, often exacerbated by changes in humidity levels. When moisture levels fluctuate, wood can expand and contract, causing nails to loosen and boards to rub against each other, creating the familiar squeaking sound. Ensuring that the subfloor and joists are properly installed and maintained is crucial in preventing these noises.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 49,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "To address and prevent floor creaks, immediate solutions include tightening any loose boards by securing them with screws or nails, ensuring a snug fit with the subfloor. Applying lubricants, such as powdered graphite or talcum powder, can reduce friction between the boards and the subfloor, silencing minor squeaks. Consulting professionals like Ryan’s Restoration are advisable for persistent problems or when DIY methods are ineffective. Experienced contractors can assess the underlying causes, perform necessary repairs, and provide long-term solutions to maintain the integrity and serenity of wood floors. ",
      "source_id": "Source_wood6",
      "source_chunk_index": 50,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    },
    {
      "content": "4. Peeling Finish Although all finishes will eventually show signs of wear, subpar or improperly applied finishes will deteriorate much sooner. If your finish starts to peel off in places, that’s a sure sign that something went wrong during application — and you’ll probably have to sand everything down and start again. Typically, a peeling finish indicates that dirt or chemicals, such as stain residue, were not removed before applying the stain. These contaminants prevent the wood from holding its finish.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 51,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "12. Debris in the Finish Just as scratches can be introduced during the sanding and finishing process, debris can also find its way into the finish. Any pieces of hair, dirt, or other contaminants not removed before finishing — or that come in contact with the finish as it dries — can become a permanent part of the finish. The only way to remove the debris is to resand and refinish. 13. Polyurethane Droplets If you finish your floors during a change of seasons, uncured polyurethane can seep between the cracks as the boards contract. Later, as the boards expand and force the poly back to the surface, you may notice drops of polyurethane forming along the edges of your floorboards. If you catch them in time, poly drops can be removed easily with a razor blade, a rag, and cleaning solution.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 52,
      "file_path": "https://www.builddirect.com/blogs/expert-advice-on-flooring/wood-flooring-issues-and-their-causes?srsltid=AfmBOorcQGh6RtwRVvogjx-aOngDqFQPsF3xCerUDHGOZB8Ymg6j0W3A"
    },
    {
      "content": "Solve your wood floor issues with expert help – Contact Ryan’s Restoration for professional solutions today! FAQ Q: What are the common types of hardwood floor damage? A: The Stanford Question Answering Dataset (SQuAD) equation identifies several types of hardwood floor damage. These include scratches, dents, water damage, cupping, buckling, warping, discolouration, and creaks. Regular maintenance can mitigate these issues. Q: How can signs of bad hardwood floor installation be identified? A: Poor hardwood floor installation may show uneven surfaces, excessive gaps, or loose planks. Use the SQuAD equation to check these signs early to prevent further damage.  ",
      "source_id": "Source_wood6",
      "source_chunk_index": 53,
      "file_path": "https://ryansrestoration.co.uk/7-common-wood-floor-problems-and-their-expert-solutions/"
    }
  ]
}
